{
  "backend/main.mo": "Defines the backend canister with types, authorization mixin, storage maps, and query methods for profiles and other domain data.",
  "feature_evidence.json": "Lists feature evidence for admin dashboard work, including involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides one‑line descriptions of many frontend files for build and feature mapping.",
  "frontend/index.css": "Tailwind base styles defining a custom OKLCH color system for light and dark modes.",
  "frontend/index.html": "HTML entry point setting language to Portuguese and loading the main React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, and generated icon assets.",
  "frontend/src/App.tsx": "Main router configuration wiring all application routes including /admin.",
  "frontend/src/components/AdminGate.tsx": "Access‑control wrapper component that restricts sections to authenticated admins.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editor de texto para recursos gerados, permitindo edição, download do arquivo e envio por e‑mail.",
  "frontend/src/components/appeal/AppealWizard.tsx": "Assistente em etapas para gerar recursos, coletando plataforma, motivo, descrição e evidências, e depois exibindo o editor.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "Lista de evidências cadastradas permitindo seleção múltipla com badges, datas formatadas e estado de carregamento.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "Botão que abre cliente de e‑mail com texto do recurso e alerta sobre anexos manuais necessários.",
  "frontend/src/components/AppLayout.tsx": "Layout principal com navegação, menu lateral responsivo e itens condicionais para usuários autenticados e administradores.",
  "frontend/src/components/AuthGate.tsx": "Componente que bloqueia acesso a conteúdo até que o usuário esteja autenticado, exibindo alerta e botão de login.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "Renders filters for platform, reason, region, and period, updating parent state on selection.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "Dialog prompting users to anonymously share a report with region and neighborhood selection and optional 'don't ask again' setting.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "Displays a filtered bar chart showing report counts per platform using collective report data.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "Shows a vertical bar chart of report counts by reason, filtered by various criteria.",
  "frontend/src/components/collective/TrendChart.tsx": "Plots a time‑based line chart of daily report counts over a selected period with applied filters.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "Provides dropdown filters for evidence type and platform, updating the parent with selected values.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "Toolbar for selecting all/none evidence items and exporting selected ones as a ZIP.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable evidence timeline with selectable cards and image previews, loading data via useGetTimeline.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a form to upload new evidence, submit metadata, and store images in IndexedDB.",
  "frontend/src/components/LoginButton.tsx": "Botão de login/logout integrado ao Internet Identity, lidando com estados de autenticação e limpeza de cache.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Lets users edit financial loss profile data and save it via useSetLossProfile.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a bar chart showing 30/60/90‑day loss projections based on calculated values.",
  "frontend/src/components/loss/LossReportActions.tsx": "Offers actions to download or share a text-based loss report generated from profile data.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays weekly, monthly, accumulated, and 90‑day projected loss metrics in summary cards.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal exibido para novos usuários preencherem nome e e-mail antes de continuar, salvando o perfil via API.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Controls starting and ending work sessions and periodically logs weather data while active.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of work sessions with loading, empty, and active session states, allowing navigation to session details.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Combines controls for starting work sessions with a list of previous sessions, tracking the active session ID.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Guards access to features based on subscription entitlement, showing locked UI with upgrade prompts when restricted.",
  "frontend/src/components/trust/TrustBadges.tsx": "Renders a set of trust and security badges for display on marketing or checkout pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating related queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for fetching all user access info and blocking or unblocking users via admin actor methods.",
  "frontend/src/hooks/useAppeals.ts": "Implements hooks for generating appeals and fetching individual or user-specific appeals from the backend.",
  "frontend/src/hooks/useCollectiveReports.ts": "Contains hooks for submitting and retrieving collective reports using the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Exposes current user authentication state, principal identifiers, and logout functionality.",
  "frontend/src/hooks/useEvidence.ts": "Supplies hooks for creating evidence, fetching evidence by ID or all evidence, and retrieving a filtered timeline.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity authentication, including login, logout, and stored identity handling.",
  "frontend/src/hooks/useIsAdmin.ts": "Fetches and exposes whether the current caller is an admin.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and update the caller’s loss profile from the backend.",
  "frontend/src/hooks/useQueries.ts": "Fetches a predefined Reviso Motivada message from the backend.",
  "frontend/src/hooks/useSubscription.ts": "Manages subscription status, entitlement evaluation, and subscription upgrades through backend calls.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the current user's profile using react-query and actor calls.",
  "frontend/src/hooks/useWorkSessions.ts": "Hooks for logging, ending, updating weather, and fetching work sessions with react-query.",
  "frontend/src/index.css": "Tailwind base configuration defining CSS variables for light and dark themes.",
  "frontend/src/lib/collectiveOptions.ts": "Maps regions to predefined neighborhood lists and exposes a lookup function.",
  "frontend/src/lib/evidenceIndexedDb.ts": "IndexedDB helpers to store and retrieve evidence images plus a hook to expose them as object URLs.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses from a loss profile.",
  "frontend/src/lib/mailto.ts": "Builds mailto links for appeals using platform-specific emails and subjects.",
  "frontend/src/lib/payments/checkoutState.ts": "Stores, retrieves, and clears the selected subscription plan in sessionStorage.",
  "frontend/src/lib/pdfReport.ts": "Generates a text-based PDF-like loss report as a downloadable blob.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plans and provides a lookup by plan ID.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates user entitlement and formats subscription expiry dates.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data for a city and maps API results to internal conditions.",
  "frontend/src/lib/zipExport.ts": "Exports evidence metadata and images by generating downloads for each item.",
  "frontend/src/main.tsx": "Initializes React app with react-query and Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing user access info with search, blocking, and unblocking actions.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Form for generating appeals using platform, reason, explanation, and selected evidence, calling an API and handling subscription errors.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout flow that retrieves a selected plan and processes payments via various methods, upgrading the user's subscription.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays collective deactivation analytics with filters and charts for platforms, reasons, regions, and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard offering quick access shortcuts and navigation cards to core modules like evidences, calculator, appeals, and collective data.",
  "frontend/src/pages/DataPolicyPage.tsx": "Static page presenting the app’s data policy, detailing principles, legal bases, data categories, and purposes.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Shows detailed information about a single evidence item, including image, metadata, platform, and notes.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Renders the evidence tracker with tabs for uploading evidence and managing work sessions, wrapped in an AuthGate.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Displays a loss calculation workflow with a profile form, results, projection chart, and report actions behind authentication.",
  "frontend/src/pages/PaymentsPage.tsx": "Shows available payment methods, links to plan selection, and includes trust badges and payment info.",
  "frontend/src/pages/PlansBillingPage.tsx": "Lists subscription plans, highlights popular options, handles plan selection, and shows current entitlement details.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Provides a subscription dashboard showing current plan status and a comparison of all available plans with upgrade options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the app’s privacy policy inside a scrollable card with structured sections.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to view and update personal profile data and shows their Internet Identity information.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Landing page presenting core features and navigation actions for plans and privacy details.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Provides a form to search process numbers and displays placeholder alerts for upcoming tracking features.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Fetches and displays detailed information for a work session including times, city, weather, and duration.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, animations, plugins, and content paths.",
  "project_state.json": "Project state file outlining app summary, architecture notes, features, and version metadata."
}