{
  "backend/main.mo": "Main actor defining types (Evidence, Appeal, WorkSession, LossProfile, Testimonial, PaymentConfig, etc.) and importing authorization mixins and access control modules for a gig-worker rights platform.",
  "feature_evidence.json": "Feature evidence report documenting the PIX QR code display bug fix, listing affected files (PixQrCodeDisplay.tsx, qrCodeGenerator.ts) and related components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, components, and utilities, noting stubbed backend methods and type imports from backend-extended.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, and other UI tokens.",
  "frontend/index.html": "HTML entry point with Portuguese locale, PWA manifest, favicon references, theme color, and Google Fonts preconnect for Inter font family.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and standalone display mode for \"ROTAS E DIREITOS\" application.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router, defining all application routes (dashboard, evidence, appeals, payments, admin, etc.) with authentication-aware index component and ProfileSetupModal.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "An admin panel for moderating testimonials, allowing admins to approve or reject pending testimonials with status badges and formatted timestamps.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "An empty file, likely a placeholder for MercadoPago payment integration setup documentation or UI.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "A comprehensive form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types, installments, and return/webhook URLs.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Displays and manages PagBank webhook and return URLs, with auto-generated webhook URL and copy-to-clipboard functionality.",
  "frontend/src/components/AdminGate.tsx": "Authorization guard component that checks authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "An editor component for reviewing and modifying generated appeal text, with download and email sending capabilities.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A wizard form for generating appeals by collecting platform, reason category, user explanation, and optional evidence IDs.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for selection, showing type badges, platform badges, and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that generates a mailto link for sending appeals via email, with an alert informing users they must manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with sticky header, logo, mobile menu toggle, navigation items for authenticated users, and conditional admin dashboard link.",
  "frontend/src/components/AuthGate.tsx": "A component that blocks access to children content until the user authenticates via Internet Identity, displaying a login prompt with a customizable message.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for submitting anonymous collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A card component displaying a bar chart of collective report counts grouped by platform using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A card component displaying a pie chart showing the distribution of collective reports by reason category using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "A card component displaying a line chart showing the trend of collective reports over time grouped by month using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar component that appears when evidence items are selected, showing count and providing export and clear selection buttons.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "A timeline component displaying evidence items from IndexedDB with filtering, multi-selection via checkboxes, and integration with the selection toolbar for bulk operations.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Form component for uploading evidence with tabs for real-time capture or file upload, supporting multiple evidence types (selfie, screenshot, audio, video) with metadata fields (platform, region, neighborhood, notes) and IndexedDB storage.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Tabbed panel component for capturing photo, audio, or video evidence in real-time using custom hooks (useCamera, useMediaRecorder) with preview, recording controls, and duration display.",
  "frontend/src/components/LoginButton.tsx": "A button component that toggles between login and logout states, handling Internet Identity authentication and clearing the query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and saving financial loss profile data including daily earnings, days per week, deactivation date, and platform selection with validation and API integration.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Line chart component using Recharts to visualize projected earnings loss over 90 days based on a user's loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Action buttons component for downloading or sharing generated loss reports as text files with clipboard and native share API support.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Dashboard cards displaying calculated weekly, monthly, and accumulated financial losses with icons and formatted currency values.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Carousel banner component showcasing platform features across five slides with navigation controls, auto-advance, and click-through to plans page.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Data file defining five banner slides with headlines, subheadlines, and image paths for desktop and mobile versions of the marketing carousel.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state for marketing banners with auto-advance, manual navigation, and pause/resume controls.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "React component that displays a step-by-step guide for configuring PagBank payment integration, including account setup, API credentials, webhook configuration, and SSL/HTTPS information.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays an alert when a payment provider is not configured, with role-based messaging and admin navigation for configuration.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Component that displays payment flow status (pending, completed, failed) with appropriate UI feedback, action buttons, and navigation options based on payment state.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "Component that generates and displays a PIX QR code for payment, including the QR code image, PIX key, and copy-to-clipboard functionality for both key and payload.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to set up their profile with name (required) and email (optional) when no user profile exists.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Component for starting and ending work sessions with city selection, automatic weather sampling every 30 minutes during active sessions.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Component that displays a list of work sessions with timestamps, city, weather sample counts, and active session indicators, with navigation to session details.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Main component for work session management that renders a card with controls to start/stop sessions and displays a list of work sessions, managing active session state.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and displays a locked state with upgrade prompts when users lack required subscription (free or pro) to access features.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog component for authenticated users to submit testimonials with form validation, character limits, success/error handling, and authentication checks via Internet Identity.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Static testimonial data with six hardcoded testimonials from delivery workers, used as fallback when backend testimonials are unavailable.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays a grid of testimonials from backend or fallback static data, with loading skeletons and a button to open the submit testimonial dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Data Protection, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin hooks for fetching all user access info and blocking/unblocking users, with mutations throwing not-yet-implemented errors for block operations.",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Mutation hook for updating payment configuration (admin only) with error sanitization to prevent exposing sensitive backend data.",
  "frontend/src/hooks/useAppeals.ts": "React Query hooks for appeal generation and retrieval that currently throw not-yet-implemented errors as backend methods are pending.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Custom hook managing user progress through blocked account help steps with localStorage persistence per principal, tracking completed steps and checklist items.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for managing legal cases, including fetching all cases, getting a case by ID, creating, updating, attaching evidence, and attaching appeals. All operations use local storage via casesStorage and invalidate queries on mutations.",
  "frontend/src/hooks/useCollectiveReports.ts": "Defines hooks for submitting and retrieving collective reports by platform, region, and neighborhood. Both hooks throw errors indicating the backend does not implement collective report functionality.",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps useInternetIdentity to provide authentication status, principal ID, shortened ID, and logout functionality for the current user.",
  "frontend/src/hooks/useEvidence.ts": "Provides hooks for fetching, uploading, and deleting evidence with various metadata (type, platform, region, quality). All backend operations throw errors as evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state (idle, initiating, pending, completed, failed) with mutations to create payment sessions and check payment status, invalidating subscription queries on success.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages a homepage style variant (A, B, or C) persisted in localStorage with a toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, identity state, and status tracking. Includes a provider component that wraps the app and manages AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend actor to check if the current caller has admin privileges, returning admin status, loading state, and any errors.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set a user's loss profile. The get operation returns null as the backend method is not implemented; the set operation calls the backend actor.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using the MediaRecorder API, managing recording state (recording, paused, duration, errors) and providing start, stop, pause, resume, and cancel functions.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "File appears to be empty or contains no content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Custom React hook managing PagBank payment flow state (idle, initiating, pending, completed, failed) with mutations for creating payment sessions and checking payment status.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "React Query hooks for fetching and updating PagBank return/webhook URL configuration via actor methods.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "React Query hooks for fetching and updating PagBank transparent checkout configuration via actor methods.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "React Query hook that fetches public (non-sensitive) payment provider configuration with 30-second cache.",
  "frontend/src/hooks/useQueries.ts": "React Query hook for fetching reviso motivada message (backend method not yet implemented, returns placeholder).",
  "frontend/src/hooks/useSubscription.ts": "React Query hooks for fetching subscription status and evaluating user entitlements based on subscription rules.",
  "frontend/src/hooks/useTestimonials.ts": "React Query hooks for managing testimonials: fetching approved/pending testimonials, submitting new testimonials, and updating testimonial status with error sanitization.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile via actor methods.",
  "frontend/src/hooks/useWorkSessions.ts": "React Query hooks for work session management including logging sessions, ending sessions, and adding weather samples (some backend methods not yet implemented).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a black background with orange/white color scheme, including dark mode and alternative style variants (teal and warm sunset).",
  "frontend/src/lib/canisterConfig.ts": "Utility functions to extract canister ID from environment variables or IC domain hostname, and generate webhook URLs for the backend canister.",
  "frontend/src/lib/casesStorage.ts": "LocalStorage-based CRUD operations for case management including creating cases, updating status, attaching evidence, generating appeals, and managing timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region and neighborhood options for collective action forms, mapping regions (Fortaleza, Caucaia, Maracanaú) to their respective neighborhoods.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages IndexedDB storage for evidence media (images, audio, video) and metadata, providing hooks and functions to store/retrieve evidence with support for multiple media types.",
  "frontend/src/lib/lossCalculations.ts": "Calculates financial losses for deactivated drivers including weekly, monthly, accumulated, and projected losses based on daily earnings and deactivation date.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform appeals and support emails, mapping platforms to their support email addresses.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages session storage for selected subscription plan during checkout flow.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing errors by type and indicating whether admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages, handling configuration, authentication, and payment processing errors.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages with error type categorization and admin action flags.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation and TLV formatting.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway or PagBank) in localStorage and determines active provider from public config with PagBank prioritized over gateway.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Dynamically loads the qrcodejs library from CDN and generates QR code data URLs client-side by rendering to a temporary DOM container and extracting the canvas or image data.",
  "frontend/src/lib/pdfReport.ts": "Generates plain-text loss reports for delivery drivers, calculating weekly, monthly, and accumulated earnings losses based on deactivation profiles.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan metadata (free 24h, pro monthly, pro annual) with pricing, features, and a helper to retrieve plans by ID.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status (trial, pro, expired) and formats expiry dates for display.",
  "frontend/src/lib/supportSummary.ts": "Generates case summaries and mailto links for support emails, including case details, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of appeal and communication templates categorized by platform, reason, and type (appeals, rights, evidence guidelines).",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages for authentication, authorization, and not-found scenarios.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps conditions to backend WeatherCondition enum, with fallback defaults.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently logs evidence IDs to console.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for user management (block/unblock), payment configuration (gateway/PagBank), testimonial moderation, and PagBank setup guide.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating appeal letters using a wizard, evidence picker, and displaying/downloading/emailing the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment initiation for subscription plans, supporting both Gateway and PagBank providers with PIX QR code display, status checking, and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated community data about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with navigation cards to key modules (evidence tracker, loss calculator, appeal generator, collective data) and quick access shortcuts to payments, profile, and quick search.",
  "frontend/src/pages/DataPolicyPage.tsx": "Static page displaying the data policy and LGPD compliance information, explaining data categories, legal bases, treatment purposes, and user rights.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view for a single evidence item, displaying metadata (type, platform, region, timestamp) and rendering the associated media (image, audio, or video) from IndexedDB.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Tabbed page with authentication gate for managing evidence uploads and work sessions, containing upload form, timeline view, and work sessions section.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Page for calculating financial losses from platform deactivation, featuring a profile form, results cards, projection chart, and report generation actions behind an authentication gate.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays available payment methods (PIX, Credit Card, Bank Slip) with icons and descriptions, includes a CTA to view plans and trust badges.",
  "frontend/src/pages/PlansBillingPage.tsx": "Shows subscription plans with pricing and features, displays current subscription status with expiry dates, and provides upgrade buttons to navigate to checkout.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Dashboard for managing subscriptions showing current plan status, expiry information, and a comparison grid of all available plans with upgrade options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy in a scrollable card covering data collection, usage, storage on Internet Computer blockchain, and user rights.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page with form to update name and email, displays Internet Identity Principal ID, and handles profile save mutations.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing app features (evidence tracker, loss calculator, resource generator, collective data), includes marketing banner, testimonials, and style variant toggle (A/B/C).",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "React page component for searching and tracking administrative appeals and legal processes, currently showing a placeholder UI with a search form and future features list.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "React page component that displays detailed information about a work session including start/end times, location, duration, and weather conditions, with navigation back to the evidence list.",
  "frontend/src/types/backend-extended.ts": "TypeScript type definitions extending backend types with enums and interfaces for Region, EvidenceType, Evidence, Appeal, CollectiveReport, and PublicLossProfile that are missing from the backend interface.",
  "frontend/src/types/case.ts": "TypeScript type definitions for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus, and CreateCaseParams interfaces.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript file for MercadoPago payment integration types.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file for QR code type definitions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, typography and animation plugins, and custom utility classes.",
  "project_state.json": "Project state metadata tracking a fix request for PIX QR code display issue in checkout flow, with pending architecture requirements for component integration and payload generation verification."
}