{
  "backend/main.mo": "Main Motoko actor defining types (Evidence, WorkSession, Appeal, LossProfile, Testimonial, PaymentConfig, etc.) and integrating MixinAuthorization and AccessControl modules for a gig worker rights platform.",
  "feature_evidence.json": "Feature evidence report documenting a single feature to increase the logo size in AppLayout header, with high confidence and associated test ID REQ-1.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, components, utilities, and styling, noting many backend methods are stubbed/unimplemented and types are imported from backend-extended.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, accent, destructive, borders, charts, and sidebar colors.",
  "frontend/index.html": "HTML entry point with Portuguese language, favicon/app-icon references, PWA manifest link, theme color, and Google Fonts preconnect for Inter font family.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name 'ROTAS E DIREITOS', standalone display mode, theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (dashboard, evidence, loss calculator, appeals, collective insights, plans, payments, profile, policies, admin) with AppLayout wrapper and ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "An admin panel for moderating testimonials, allowing approval or rejection of pending testimonials with status badges and formatted timestamps.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely a placeholder for MercadoPago payment integration setup instructions.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "A comprehensive form for configuring PagBank transparent checkout settings including payment types, installments, credentials, and return/webhook URLs.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Displays and manages PagBank webhook and return URLs, with auto-generated webhook URL and copy-to-clipboard functionality.",
  "frontend/src/components/AdminGate.tsx": "Access control component that verifies authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "An editor component for reviewing and modifying generated appeal text with download and email sending capabilities.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A wizard form for generating platform appeals by collecting platform, reason category, user explanation, and optional evidence IDs.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for selection, showing type badges, platform badges, and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that generates a mailto link for sending appeals via email, with an alert informing users they must manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with sticky header containing logo, mobile menu toggle, navigation items (dashboard, evidence, calculator, appeals, collective), account items (profile, plans, processes), legal links, and LoginButton.",
  "frontend/src/components/AuthGate.tsx": "A component that blocks access to children content until the user authenticates via Internet Identity, displaying a login prompt with customizable message.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for submitting anonymous collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A card component displaying a bar chart of collective report counts grouped by platform using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A card component displaying a pie chart of collective report counts grouped by reason category using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "A card component displaying a line chart showing the trend of collective reports over time, grouped by month using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar component that appears when evidence items are selected, showing count and providing export and clear selection buttons.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "A timeline component displaying evidence items from IndexedDB with filtering, multi-selection via checkboxes, and integration with the selection toolbar for bulk export.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Form component for uploading evidence with tabs for real-time capture and file upload, supporting multiple evidence types (selfie, screenshot, audio, video) with metadata fields like platform, region, and notes. Saves evidence to IndexedDB and displays toast notifications.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Tabbed panel component for capturing evidence in real-time via photo, audio, or video using custom hooks (useCamera, useMediaRecorder). Displays camera preview, recording controls with duration display, and handles media capture callbacks.",
  "frontend/src/components/LoginButton.tsx": "A login/logout button component that manages Internet Identity authentication state and clears the query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and saving financial loss profile data including daily earnings, days per week, deactivation date, and platform. Uses React Query hooks to fetch and update loss profile data.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Chart component that displays a 90-day projected earnings loss using Recharts LineChart, calculating loss projections at 10-day intervals based on the user's loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Action buttons component for downloading and sharing loss reports as text files, with fallback to clipboard copy if native share API is unavailable.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Dashboard cards displaying calculated weekly, monthly, and accumulated financial losses based on the user's loss profile, with icons and formatted currency values.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Carousel banner component showcasing platform features across 5 slides with navigation controls, auto-advance functionality, and click-through to pricing page. Supports variant styling (A/B/C).",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Data file defining 5 banner slides with headlines, subheadlines, and image paths for desktop and mobile versions, covering features like evidence tracking, loss calculator, resource generator, insights, and security.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state for marketing banners with auto-advance, manual navigation (next/prev/goTo), and pause/resume functionality.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "Displays a step-by-step setup guide for PagBank payment integration, including account creation, API credentials retrieval, webhook configuration, and SSL/HTTPS notices.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays an alert when a payment provider is not configured, with role-based messaging and admin navigation for configuration.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Displays payment flow status (pending, completed, failed) with appropriate UI feedback, action buttons, and navigation options based on payment state.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to set up their profile with name (required) and email (optional) when no profile exists.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides UI controls to start/end work sessions with city selection, automatically fetches and logs weather samples every 30 minutes during active sessions.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with city, timestamps, weather sample counts, and active session badges; navigates to session details on click.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing active session state between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and subscription status, blocking content and showing upgrade prompts for expired or insufficient subscriptions.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog component for submitting testimonials with form validation, authentication check via Internet Identity, and success/error state handling. Includes character limits and Portuguese error messages.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Defines the Testimonial interface and exports static testimonial data for delivery workers from various platforms (iFood, Uber, Rappi, 99).",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays a grid of testimonials with loading skeletons, falling back to static data if no backend testimonials exist. Includes a submit dialog trigger button.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Protected Data, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for admin functionality including fetching all user access info and blocking/unblocking users (latter two not yet implemented in backend).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Mutation hook for updating payment configuration with error sanitization to prevent exposing sensitive backend data. No query method exposed for security.",
  "frontend/src/hooks/useAppeals.ts": "Hooks for appeal generation and retrieval (generate, get by ID, get caller appeals) - all backend methods are not yet implemented.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages blocked account help progress state in localStorage, tracking current step, completed steps, and checklist items per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides hooks for case management (CRUD operations, attaching evidence/appeals) using local storage via casesStorage module, keyed by user principal.",
  "frontend/src/hooks/useCollectiveReports.ts": "Hooks for submitting and retrieving collective reports by platform/region - backend implementation not available, returns empty arrays.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authentication state and user identity information (principalId, shortId) derived from Internet Identity, along with a logout function.",
  "frontend/src/hooks/useEvidence.ts": "Defines React Query hooks for evidence management (get, upload, delete) but notes that backend methods are not implemented and evidence is stored in IndexedDB client-side.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state (idle, initiating, pending, completed, failed) with mutations to create payment sessions and check payment status, invalidating subscription queries on success.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) persisted to localStorage with a toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using DFINITY AuthClient with custom configuration for derivation origin.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to check if the current caller has admin privileges using the isCallerAdmin actor method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set user loss profiles, though the get method notes backend implementation is not yet available.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for audio/video recording using MediaRecorder API with state management for recording, pausing, duration tracking, and file generation.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file, no implementation for MercadoPago payment integration.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow with mutations to create payment sessions (redirecting to checkout URL) and check payment status, updating subscription queries on completion.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return/webhook URL configuration with query invalidation on updates.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to get and set PagBank transparent checkout configuration with query cache invalidation.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration from the backend with 30-second cache stale time.",
  "frontend/src/hooks/useQueries.ts": "Provides a query hook for fetching a 'reviso motivada' message, though notes the backend method is not yet implemented.",
  "frontend/src/hooks/useSubscription.ts": "Queries user subscription status from backend and provides an entitlement evaluation hook that applies business rules to determine access levels.",
  "frontend/src/hooks/useTestimonials.ts": "React Query hooks for managing testimonials: fetching approved/pending testimonials, submitting new testimonials, and updating testimonial status (admin only). Includes error sanitization and query invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the caller's user profile using the actor. Handles loading states and query invalidation on save.",
  "frontend/src/hooks/useWorkSessions.ts": "React Query hooks for work session management including logging sessions, ending sessions, adding weather samples, and fetching sessions. Most backend methods are not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a black background with orange/white color scheme, including dark mode and alternative style variants (teal/cyan and warm sunset).",
  "frontend/src/lib/canisterConfig.ts": "Utility functions to get the backend canister ID from environment variables or window location, and generate webhook URLs for PagBank integration.",
  "frontend/src/lib/casesStorage.ts": "LocalStorage-based CRUD operations for managing legal cases, including creating cases, updating status, attaching evidence/appeals, and maintaining timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides a function to get neighborhoods for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "IndexedDB wrapper for storing and retrieving evidence media (images, audio, video) and metadata with React hooks for accessing stored media as object URLs.",
  "frontend/src/lib/lossCalculations.ts": "Utility functions to calculate weekly, monthly, accumulated, and projected financial losses based on a public loss profile.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support emails with pre-filled subject and body content.",
  "frontend/src/lib/payments/checkoutState.ts": "Session storage utilities for persisting and retrieving the selected subscription plan during checkout flow.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing them by type (provider disabled, auth failures, declined payments, timeouts, network issues) and indicating whether admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into Portuguese user messages, handling provider configuration issues, authentication failures, payment declines, and webhook validation errors with admin action flags.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages, categorizing errors by type and providing admin-specific guidance for configuration issues.",
  "frontend/src/lib/payments/pixPayload.ts": "Empty file with no content.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection UI state in localStorage (not secrets), determines active provider from public config with PagBank prioritized over Gateway, and provides utilities for getting/setting selected provider.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports for driver deactivation cases, calculating weekly, monthly, and accumulated earnings losses based on profile data and formatting them into a downloadable blob.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free 24h trial, monthly pro, annual pro) with pricing, features, and billing periods in Portuguese, providing lookup utilities for plan metadata.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates user subscription entitlements by checking plan status, expiration, and trial/pro flags, and provides formatting utilities for displaying expiry dates and remaining days.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries for driver deactivation cases and creates pre-filled support email links with case details, evidence counts, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of pre-written templates for driver appeals, rights documentation, evidence collection guides, and communication templates, organized by category and platform with searchable tags.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes testimonial submission errors into safe English user messages, handling authentication failures, authorization issues, not-found errors, and admin-only action restrictions.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps weather conditions to internal WeatherCondition enum, with fallback to default values on error.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently only logs evidence IDs to console.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for user management (blocking/unblocking), payment configuration (Gateway and PagBank providers), testimonials moderation, and PagBank setup guide.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters using a wizard interface and evidence picker, with options to download or email the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans, supporting both Gateway and PagBank providers with status tracking and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated data about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with navigation cards for core modules (evidence tracker, loss calculator, appeal generator, collective data) and quick access buttons for payments, profile, and quick search.",
  "frontend/src/pages/DataPolicyPage.tsx": "Displays a comprehensive data policy page explaining LGPD compliance, data categories collected (personal, work, financial, evidence), treatment purposes, user rights, and data retention policies in Portuguese.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Shows detailed view of a single evidence item with media preview (image/audio/video), metadata badges (type, platform, region), and navigation back to evidence list using IndexedDB hooks.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Main evidence tracking page with tabbed interface for managing evidence uploads and work sessions, protected by AuthGate requiring user authentication.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Calculates and displays financial losses from platform deactivation using loss profile form, results cards, projection chart, and report generation actions, protected by AuthGate.",
  "frontend/src/pages/PaymentsPage.tsx": "Informational page showcasing available payment methods (PIX, credit card, bank slip) with trust badges and navigation to plans page.",
  "frontend/src/pages/PlansBillingPage.tsx": "Displays subscription plans with pricing, features comparison, current plan status, and upgrade buttons that navigate to checkout with selected plan.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Subscription management dashboard showing current plan status, expiry details, and side-by-side plan comparison with upgrade options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy page with sections on data collection, usage, storage, security, and user rights. Uses Card and ScrollArea components to present the policy content in Portuguese.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to view and update their name and email. Displays Internet Identity Principal ID and uses form validation with toast notifications.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Landing page showcasing app features (evidence tracker, loss calculator, appeal generator, collective data) with marketing banners, testimonials, and a style variant toggle (A/B/C). Includes trust badges and call-to-action buttons.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality where users can search for administrative appeals and legal processes by number. Currently shows a development notice and planned features.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, and weather conditions. Fetches session data by ID from route params.",
  "frontend/src/types/backend-extended.ts": "Extends backend types with enums and interfaces not exported from the generated backend declarations, including Region, EvidenceType, Evidence, ReasonCategory, Appeal, CollectiveReport, and PublicLossProfile.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus, and CreateCaseParams for tracking deactivation cases and their associated evidence and appeals.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript file, likely a placeholder for future Mercado Pago payment integration type definitions.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file, likely a placeholder for QR code library type definitions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and extended theme properties including sidebar and chart colors.",
  "project_state.json": "Project state metadata tracking an existing feature to increase logo size in AppLayout header and a pending feature request to make the logo larger and more visible."
}