{
  "backend/main.mo": "Main Motoko actor defining all data types (Evidence, Appeal, WorkSession, LossProfile, CollectiveReport, Testimonial, Payment, Subscription) and implementing core business logic with authorization mixins, access control, and HTTP outcalls integration.",
  "feature_evidence.json": "Feature evidence report mapping payment gateway integration features to implementation files, components, and test IDs with high confidence ratings for checkout, payment hooks, status tracking, admin configuration, and error handling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks with stubbed backend methods, IndexedDB storage, utility libraries, and components for evidence, sessions, loss reports, and collective reporting.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based dark-first color system using CSS custom properties for theming, including light/dark mode variants and sidebar-specific color tokens.",
  "frontend/index.html": "HTML entry point with Portuguese locale, PWA manifest, favicon/app-icon links, theme color meta tag, and preconnected Google Fonts loading Inter font family.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode (standalone), and theme colors for ROTAS E DIREITOS application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (dashboard, evidence, sessions, appeals, collective insights, plans, payments, checkout, profile, admin) with authenticated layout and profile setup modal.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating testimonials with approve/reject actions, status badges, and formatted timestamp display.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely placeholder for MercadoPago payment integration setup instructions.",
  "frontend/src/components/AdminGate.tsx": "Authorization guard component that checks authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editable text area for reviewing and modifying generated appeal text with download and email sending capabilities.",
  "frontend/src/components/appeal/AppealWizard.tsx": "Multi-step form for generating appeals by selecting platform, reason category, providing explanation, and optionally attaching evidence.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "Checkbox-based evidence selection component that loads evidence from IndexedDB and displays them with type and platform badges.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "Button that opens default email client with pre-filled appeal content and displays alert about manually attaching evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component with responsive navigation, sidebar menu, and authentication-aware UI including admin-specific routes and quick access items.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt when user is not authenticated, otherwise renders children.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "Renders filter dropdowns for platform, region, and reason category to filter collective reports. Uses Select components with controlled values and change handlers.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "Form component for users to anonymously submit collective reports with platform, region, neighborhood, and reason fields. Handles submission via mutation hook and shows success state.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "Displays a bar chart showing the distribution of collective reports across different platforms using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "Renders a pie chart visualizing the distribution of block reasons across collective reports with labeled percentages using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "Line chart component that groups collective reports by month and displays trends over time using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "Filter controls for evidence type and platform with Select dropdowns and controlled state handlers.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "Toolbar that appears when evidence items are selected, showing count and providing export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Timeline view of evidence items with filtering, multi-select checkboxes, and navigation to detail pages. Loads evidence from IndexedDB.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Tabbed form for adding evidence via real-time capture or file upload, with fields for type, notes, platform, region, and neighborhood. Saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "React component providing a tabbed interface for capturing photos, audio, and video evidence in real-time using camera and media recorder hooks. Includes preview, recording controls, duration display, and file capture callbacks.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for users to input their financial profile (daily earnings, work days per week, deactivation date, platform) to calculate losses from platform deactivation. Loads existing profile data and saves updates via mutation hooks.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Displays a line chart showing projected earnings loss over 90 days based on a user's loss profile, using Recharts for visualization.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for generating and distributing loss reports as text files, with fallback to clipboard copy if native sharing is unavailable.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated financial losses calculated from a user's loss profile.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Interactive carousel banner showcasing platform features (evidence tracking, loss calculator, resource generator, insights, security) with multiple visual variants, auto-advance, and navigation controls. Includes platform badges and service descriptions.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and desktop/mobile image paths.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook managing carousel state with auto-advance timer, manual navigation (next/prev/goto), and pause/resume functionality.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty component file with no content.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Displays an alert when a payment provider is not configured, with role-based messaging and an admin dashboard link for administrators to set up credentials.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "React component that displays payment flow status (pending, completed, failed) with appropriate UI feedback, action buttons, and navigation options based on the current payment state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to set up their profile with name and optional email on first login.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Component for starting and ending work sessions with city selection, automatically fetching and recording weather samples every 30 minutes during active sessions.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with details like city, timestamps, and weather sample counts; allows navigation to individual session detail pages.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session ID state between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and subscription status, showing locked content UI with upgrade prompts when requirements are not met.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog form for authenticated users to submit testimonials with quote, name, and role fields; includes validation, error handling, and success confirmation.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Static data file containing an array of six default testimonials with quotes, names, and roles from delivery workers.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials in a grid layout, fetching from backend with fallback to static data; includes loading states and a submit testimonial dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Dados Protegidos, Pagamento Seguro, 100% Confiável) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "Manages backend actor creation with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for admin operations: fetching all user access info and placeholder mutations for blocking/unblocking users (not yet implemented in backend).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Provides mutation hook to update payment configuration with error sanitization and validation, invalidating public payment config on success.",
  "frontend/src/hooks/useAppeals.ts": "Defines hooks for appeal operations (generate, get by ID, get caller appeals) but all backend methods are not yet implemented.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages blocked account help flow progress (steps, checklist items) in localStorage, keyed by user principal.",
  "frontend/src/hooks/useCases.ts": "Provides hooks for case management (CRUD operations, attaching evidence/appeals) using client-side localStorage via casesStorage module.",
  "frontend/src/hooks/useCollectiveReports.ts": "Defines hooks for submitting and retrieving collective reports, but backend implementation is not available (returns empty/throws errors).",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps useInternetIdentity to provide current user authentication status, principal ID, short ID, and logout function.",
  "frontend/src/hooks/useEvidence.ts": "Provides hooks for evidence operations (get all, upload, delete) but backend methods are not implemented; evidence is stored in IndexedDB client-side.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state with mutations for creating payment sessions and checking status, including state machine for payment lifecycle.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant (A/B/C) in localStorage with toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsAdmin.ts": "Hook that queries the backend to check if the current caller has admin privileges using React Query.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks for fetching and updating user loss profiles, though the backend methods are not yet implemented.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using the MediaRecorder API, with controls for start, stop, pause, resume, and cancel operations.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file, likely a placeholder for future MercadoPago payment integration.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Hook that fetches public (non-sensitive) payment provider configuration from the backend with caching.",
  "frontend/src/hooks/useQueries.ts": "Hook for fetching a 'reviso motivada' message, currently returns a placeholder as the backend method is not implemented.",
  "frontend/src/hooks/useSubscription.ts": "Provides hooks for fetching subscription status and evaluating user entitlements based on subscription rules.",
  "frontend/src/hooks/useTestimonials.ts": "Manages testimonial CRUD operations including fetching approved/pending testimonials, submitting new ones, and updating status with admin controls and error sanitization.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the current user's profile data with React Query cache management.",
  "frontend/src/hooks/useWorkSessions.ts": "Provides hooks for managing work sessions and weather samples, though most backend methods are not yet implemented.",
  "frontend/src/index.css": "Global CSS with Tailwind directives defining CSS custom properties for theming including light/dark modes and three style variants (default, B with purple tones, C with warm amber/orange).",
  "frontend/src/lib/casesStorage.ts": "Manages case data in localStorage with CRUD operations, including creating cases, updating status, attaching evidence/appeals, and maintaining timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides neighborhood lists for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Handles IndexedDB storage for evidence media (images, audio, video) and metadata, with React hooks for loading media URLs.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses based on daily earnings and deactivation dates.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support contacts with pre-filled subjects and bodies.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage during checkout flow.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes payment gateway errors into user-friendly Portuguese messages, categorizing errors by type and required actions.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Maps backend payment errors to safe English user-facing messages with error types and admin action flags.",
  "frontend/src/lib/payments/pixPayload.ts": "Empty file, likely placeholder for PIX payment payload generation logic.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection in localStorage, currently supporting only 'gateway' provider.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports as downloadable blobs with calculated financial loss metrics.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free 24h, pro monthly, pro annual) with pricing, features, and metadata.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlements, checking expiry status, trial/pro status, and formatting expiry dates for display.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries and mailto links for support emails, including case details, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Defines template data structures and provides a library of pre-written appeal templates, driver rights information, and evidence collection guides organized by category and platform.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages, handling auth, admin-only, and not-found error cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps responses to internal WeatherCondition enum, with fallback to default values on error.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently logs evidence IDs but does not implement actual download logic.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for user management (block/unblock), payment configuration, and testimonial moderation, protected by AdminGate component.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters using a wizard interface, evidence picker, and supports downloading or emailing the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles subscription payment flow using gateway integration, displays selected plan details, payment status, and trust badges.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymized aggregate data from the driver community with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying module cards (Evidence Tracker, Loss Calculator, Resource Generator, Collective Data) and quick access buttons (Payments, Profile, Quick Consultation) with navigation links.",
  "frontend/src/pages/DataPolicyPage.tsx": "Data policy page explaining LGPD compliance, legal bases for data processing, categories of collected data (personal, work, financial, evidence), and treatment purposes with scrollable content.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view page for a single evidence item, displaying metadata (type, platform, region, upload time) and rendering media content (image, audio, or video) retrieved from IndexedDB.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Evidence tracker page with tabbed interface for managing evidence uploads and work sessions, wrapped in AuthGate for authenticated access.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Loss calculator page displaying a form to input loss profile data and showing calculated results, projection charts, and report generation actions when profile exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Payments information page showcasing available payment methods (PIX, credit card, bank slip) with trust badges and a call-to-action to view subscription plans.",
  "frontend/src/pages/PlansBillingPage.tsx": "Subscription plans page displaying three pricing tiers with features, current entitlement status, and checkout navigation for paid plan selection.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Displays subscription dashboard showing current plan status, expiration date, and a comparison grid of available plans with upgrade buttons that navigate to checkout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a static privacy policy page with sections covering data collection, usage, storage, sharing, user rights, and contact information in Portuguese.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to update their name and email, displaying their Internet Computer Principal ID with form validation and toast notifications.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing app features (evidence tracker, loss calculator, appeal generator, collective data) with dynamic style variants (A/B/C), marketing banner, testimonials, and trust badges.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality with a search form and alert indicating the feature is under development.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, and weather conditions with formatted dates in Portuguese.",
  "frontend/src/types/backend-extended.ts": "Defines TypeScript types and enums (Region, EvidenceType, ReasonCategory, Evidence, Appeal, CollectiveReport, PublicLossProfile) that extend backend types for frontend use, re-exporting Platform and Principal from the backend module.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus type, and CreateCaseParams for tracking user appeals and evidence.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript file, likely a placeholder for MercadoPago payment integration types.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file, likely a placeholder for QR code type definitions.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both standard query strings and hash-based routing with parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH, typography, animations, container settings, and plugins for the frontend application.",
  "project_state.json": "Project state tracking file documenting payment gateway integration features, including existing implementations for checkout, payment hooks, status tracking, admin configuration, and pending backend payment method and webhook handler requirements."
}