{
  "backend/main.mo": "Main Motoko actor defining all data types (Evidence, Appeal, WorkSession, LossProfile, CollectiveReport, UserProfile, Testimonial, PaymentConfig, SubscriptionStatus) and integrating blob storage and authorization mixins for the platform.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: financial loss calculator, PDF export functionality, and comprehensive dark mode theme optimized for drivers.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including hooks, components, pages, and utilities with notes on stubbed backend methods and type imports from backend-extended.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system featuring warm orange primary and deep navy secondary colors, plus comprehensive dark mode optimized for reduced eye strain during nighttime driving.",
  "frontend/index.html": "HTML entry point with Portuguese locale, updated Nova logo favicon references, PWA manifest link, and Google Fonts preloading for Outfit and Inter font families.",
  "frontend/public/manifest.webmanifest": "PWA manifest for 'ROTAS E DIREITOS' app with standalone display mode, brand colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with all application routes, QueryClient setup, ThemeProvider defaulting to dark mode, and ProfileSetupModal integration.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating testimonials with approve/reject actions. Displays pending testimonials with parsed content (quote, name, role) and status badges, handling status updates via mutations.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file for MercadoPago setup guide component (no content).",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types, installments, and return/webhook URLs with validation.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Component displaying auto-generated webhook URL with copy functionality and input for return URL configuration. Provides guidance for PagBank webhook registration.",
  "frontend/src/components/AdminGate.tsx": "Admin access control component that checks authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Text editor for reviewing and editing generated appeal text with download as .txt and email sending capabilities. Loads appeal data by ID and platform.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that generates a mailto link for sending appeals via email, with an alert informing users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component with responsive header, navigation menu (mobile and desktop), and sidebar containing nav items, account items, and legal links. Includes authentication state handling and admin-specific navigation.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt with alert UI when user is not authenticated, otherwise renders children. Provides customizable message prop.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A bar chart component that visualizes the distribution of collective reports across different platforms using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A pie chart component that displays the distribution of deactivation reasons from collective reports using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "A line chart component that shows the temporal trend of collective reports aggregated by month using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "Provides filter dropdowns for evidence type (selfie, screenshot, audio, video) and platform (iFood, Uber, Rappi, 99) with controlled state callbacks.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "Displays a toolbar when evidence items are selected, showing count and providing export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Renders a filterable timeline of evidence items from IndexedDB with multi-select checkboxes, type/platform badges, and navigation to detail views.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Tabbed form for adding evidence via real-time capture or file upload, with fields for type, platform, region, neighborhood, and notes; saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Provides tabbed interface for capturing photo, audio, or video evidence in real-time using camera and media recorder hooks with preview and recording controls.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication flow, displays loading states, and clears query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form for entering and saving financial loss profile data including daily earnings, work days per week, deactivation date, and platform.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Displays a line chart projecting financial losses over 90 days based on the user's loss profile using Recharts.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides action buttons for downloading a PDF loss report and sharing a text summary of financial losses via native share or clipboard. Uses loss calculation utilities and toast notifications.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three cards showing calculated weekly, monthly, and accumulated financial losses from a PublicLossProfile. Uses icons and destructive styling to emphasize loss amounts.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Carousel banner component showcasing platform features (evidence tracking, loss calculator, resource generator, insights, security) with navigation controls and auto-advance. Navigates to plans page on click.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and placeholder image paths for desktop and mobile.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom hook managing carousel state with auto-advance timer, manual navigation (next/prev/goto), and pause/resume controls. Handles cleanup and timer resets.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "Displays step-by-step instructions for configuring PagBank payment integration, including account creation, API credentials setup, webhook configuration, and SSL/HTTPS notices.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Shows an alert when a payment provider is not configured, with admin-specific actions to navigate to admin dashboard or user-facing messaging to contact administrators.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Displays payment flow status (pending, completed, failed) with appropriate UI, actions (retry, check status, navigate), and provider-specific messaging for Gateway or PagBank.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "Displays a PIX QR code for payment with copy-to-clipboard functionality for both the PIX key and payload, includes loading, error handling, and retry logic.",
  "frontend/src/components/payments/TransparentCheckoutCart.tsx": "Shows a checkout cart summary with selected subscription plan details, features, limitations, and a payment button for card transactions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name (required), email, platform, region, and phone. Shows automatically when user profile is null after authentication.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides controls to start/end work sessions with city selection and automatically fetches weather samples every 30 minutes during active sessions.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with start/end times, duration, city, and weather sample counts, highlighting active sessions.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session state.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Guards features based on subscription entitlement, showing upgrade prompts for expired or insufficient subscriptions with navigation to plans page.",
  "frontend/src/components/subscription/PlanComparisonMatrix.tsx": "Displays a comparison matrix of subscription plans with features, pricing, and selection buttons, supporting both mobile card and desktop table views.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog component for submitting testimonials with form validation, authentication check via Internet Identity, and success/error handling. Includes character limits and Portuguese UI text.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Defines the Testimonial interface and exports static testimonial data for delivery workers from various platforms (iFood, Uber, Rappi, 99).",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials in a grid layout with loading skeletons, falling back to static data if no backend testimonials exist. Includes a submit testimonial dialog trigger.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Data Protection, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin hooks for user access management (get all users, block/unblock), but backend methods are not yet implemented and throw errors.",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Mutation hook for updating payment configuration with error sanitization to prevent exposing sensitive backend data. No query method for security reasons.",
  "frontend/src/hooks/useAppeals.ts": "Provides hooks for generating and retrieving appeals with evidence, but all backend methods are not yet implemented and throw errors.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages local storage-based progress tracking for blocked account help flow, including steps, checklist items, and completion state per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides CRUD operations for cases using local storage (casesStorage), including creating cases, attaching evidence/appeals, and querying by ID or all cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Hooks for submitting and retrieving collective reports by platform/region, but backend methods are not implemented and return empty arrays or throw errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides current user authentication state including principal ID, short ID, and logout function by wrapping the Internet Identity hook.",
  "frontend/src/hooks/useEvidence.ts": "Defines React Query hooks for evidence management (get, upload, delete) with filters for timeline, but all backend methods are unimplemented and evidence is stored in IndexedDB client-side.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages generic payment gateway flow state (idle, initiating, pending, completed, failed) with mutations for creating sessions and checking status, but backend methods are not yet implemented.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) with localStorage persistence and a toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login, logout, and identity state management using DFINITY AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to check if the current caller has admin privileges using the isCallerAdmin actor method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set user loss profiles, though the get method is not yet implemented in the backend and returns null.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for audio/video recording using MediaRecorder API with start, stop, pause, resume, and cancel controls plus duration tracking.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file, no implementation for MercadoPago payment integration.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow with session creation and status checking mutations, including redirect to checkout URL, but backend methods are not yet implemented.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return and webhook URL configuration via backend actor methods.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to get and set PagBank transparent checkout configuration via backend actor methods.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration from the backend with caching and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch 'reviso motivada' message, but the backend method is not implemented and returns a placeholder string.",
  "frontend/src/hooks/useSubscription.ts": "Provides React hooks for fetching subscription status and evaluating user entitlements, with a placeholder returning a default free plan since backend methods are not yet implemented.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for fetching approved/pending testimonials, submitting new testimonials, and updating testimonial status (admin only), with error sanitization and query invalidation on mutations.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the caller's user profile using React Query, with automatic cache invalidation after profile updates.",
  "frontend/src/hooks/useWorkSessions.ts": "Defines React Query hooks for logging work sessions, ending sessions, adding weather samples, and fetching session data; most backend methods are not yet implemented and throw errors or return empty data.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables optimized for a driver-focused dark-mode-first design, including warm orange primary, deep navy secondary, and style variants for teal and coral emphasis.",
  "frontend/src/lib/canisterConfig.ts": "Exports functions to retrieve the backend canister ID from environment variables or window location and generate a webhook URL for PagBank integration.",
  "frontend/src/lib/casesStorage.ts": "Implements localStorage-based CRUD operations for managing user cases, including creating cases, attaching evidence/appeals, updating status, and maintaining timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides a function to retrieve neighborhoods for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages IndexedDB storage for evidence media (images, audio, video) and metadata, providing async functions and React hooks to store and retrieve evidence with automatic object URL management.",
  "frontend/src/lib/lossCalculations.ts": "Provides utility functions to calculate weekly, monthly, accumulated, and projected financial losses based on a driver's public loss profile and deactivation date.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support emails with pre-filled subject and body parameters.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage during checkout flow with save, get, and clear functions.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic gateway payment errors into user-friendly Portuguese messages, categorizing them by type (provider disabled, authentication failed, payment declined, etc.) and indicating whether they require admin action or are user errors.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages, handling provider configuration issues, authentication failures, payment declines, and webhook validation errors with appropriate user/admin action flags.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages, categorizing errors by type and providing admin-specific guidance for configuration issues.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation and TLV formatting for static PIX payments with configurable merchant details and transaction amounts.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/pagbank) in localStorage and determines the active provider from public config, prioritizing PagBank over Gateway when both are enabled.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Dynamically loads the qrcode library from CDN and generates QR code data URLs from text with configurable size and high error correction level.",
  "frontend/src/lib/pdfReport.ts": "Generates PDF loss reports using jsPDF loaded from CDN, displaying profile information and calculated financial losses (weekly, monthly, accumulated) with formatted boxes and styling.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free_24h, pro_monthly, pro_annual) with pricing, features, defense limits, and provides a helper function to retrieve plans by ID.",
  "frontend/src/lib/subscriptions/rules.ts": "Defines subscription entitlement logic, evaluating user subscription status (trial, pro, expired) and formatting expiry dates in Portuguese.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries and creates mailto links with case details for support emails.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of appeal and communication templates for different platforms (iFood, Uber) and categories (appeals, rights, evidence).",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes testimonial mutation errors into user-friendly English messages, handling auth, admin, and not-found cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities, mapping conditions to backend enum types with fallback defaults.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently logs evidence IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for managing users (block/unblock), payment configuration (Gateway/PagBank), and testimonial moderation with tabs and forms.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating appeal letters using a wizard, evidence picker, and download/email functionality with optional case linking.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment initiation and status checking for both Gateway and PagBank providers, displaying QR codes or transparent checkout forms.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays aggregated anonymous community data about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing module cards (Evidence Tracker, Loss Calculator, Resource Generator, Collective Data) and quick access buttons for Payments, Profile, and Quick Lookup.",
  "frontend/src/pages/DataPolicyPage.tsx": "Displays the LGPD-compliant data policy explaining how personal data, work data, financial data, and evidence are collected, processed, and protected.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Shows detailed view of a single evidence item (selfie, screenshot, audio, or video) with metadata like platform, region, and upload time, loading media from IndexedDB.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Tabbed page with authentication gate allowing users to upload and view evidence timeline and manage work sessions.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing the platform's four main features, benefits, and plan comparison matrix with hero section and call-to-action for unauthenticated users.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Authenticated page for calculating financial losses from deactivation, displaying results cards, projection chart, and PDF export actions based on user's loss profile.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays available payment methods (PIX, Credit Card, Bank Slip) with icons and descriptions, includes a CTA to view plans and trust badges.",
  "frontend/src/pages/PlansBillingPage.tsx": "Shows subscription plans with pricing, features, and upgrade options; displays current subscription status and entitlement information with trust badges.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Dashboard for managing user's current subscription with status details, expiry dates, and plan comparison grid with upgrade functionality.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays comprehensive privacy policy in Portuguese covering data collection, usage, storage, security, sharing practices, and user rights in a scrollable card.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management form allowing users to update personal information including name, email, platform, region, and phone number with validation.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Marketing landing page showcasing app features (evidence tracker, loss calculator, resource generator, collective data) with hero section, testimonials, plan comparison, and A/B/C style variants.",
  "frontend/src/pages/QuickAccessPage.tsx": "Page component that displays platform cards (Uber, 99, iFood) with deep-link functionality to open mobile apps or fallback to web URLs; requires authentication and redirects unauthenticated users to home.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process/appeal lookup functionality with a search form and informational alerts about upcoming features like real-time status tracking and notifications.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Empty file with no content.",
  "frontend/src/types/backend-extended.ts": "Extended TypeScript type definitions for backend entities (Evidence, Appeal, CollectiveReport, Subscription, Testimonial, Payment, Case) that are missing from the generated backend interface but needed in the frontend.",
  "frontend/src/types/case.ts": "TypeScript interfaces defining the Case entity structure including evidence attachments, appeals, timeline events, status types, and creation parameters for managing driver deactivation cases.",
  "frontend/src/types/jspdf.d.ts": "TypeScript declaration file extending the Window interface to include the jsPDF library loaded via CDN.",
  "frontend/src/types/mercadopago.ts": "Empty file with no content.",
  "frontend/src/types/qrcode.d.ts": "TypeScript declaration file extending the Window interface to include the QRCode library with methods for generating QR codes as data URLs, canvas, or strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Outfit/Inter font families, container queries, typography plugin, and comprehensive color palette for UI components including dark mode support.",
  "project_state.json": "Project state metadata tracking implemented features (financial loss calculator, PDF export, dark mode) and pending feature requests for the Rotas e Direitos driver assistance application."
}