{
  "backend/main.mo": "Main Motoko actor defining all data types (Evidence, Appeal, WorkSession, LossProfile, Testimonial, PaymentConfig, etc.) and integrating authorization mixins for access control and user management.",
  "feature_evidence.json": "Feature evidence report mapping three PIX QR code generation and debugging features to their implementation files (PixQrCodeDisplay.tsx, qrCodeGenerator.ts) and associated components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, utilities, and components, noting many backend methods are stubbed/unimplemented and types are imported from backend-extended.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system featuring brand-aligned warm orange primary and deep navy blue secondary colors, plus dark mode theme variables.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicon links, Inter font preload, and brand orange theme-color meta tag for browser UI integration.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode (standalone), and brand colors (orange theme, navy background) for installable web app experience.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (dashboard, evidence, appeals, payments, admin, etc.) with AppLayout wrapper and ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials with approve/reject actions. Displays pending testimonials with parsed content (quote, name, role) and status badges, with timestamp formatting.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely placeholder for MercadoPago payment integration setup guide component.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types, installments, and return/webhook URLs. Includes form validation and save functionality.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Component that displays and manages PagBank webhook and return URLs. Shows auto-generated webhook URL with copy-to-clipboard functionality and editable return URL input field.",
  "frontend/src/components/AdminGate.tsx": "Authorization guard component that checks authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editor component for reviewing and modifying generated appeal text. Provides textarea for editing, download as .txt functionality, and email sending option via SendViaEmailButton.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and selected evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and platform labels.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that opens a mailto link for sending appeals via email, with an alert reminding users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component with responsive header, mobile menu, and navigation sidebar. Includes navigation items for dashboard, evidence, calculator, resources, collective data, profile, plans, and legal pages, with admin-specific links conditionally rendered.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt with alert UI when user is not authenticated, otherwise renders children. Provides customizable message for authentication requirement.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter panel with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A bar chart component that visualizes the distribution of collective reports across different platforms using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A pie chart component that displays the distribution of blocking reasons in collective reports with labeled percentages.",
  "frontend/src/components/collective/TrendChart.tsx": "A line chart component that shows the monthly trend of collective reports over time using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter panel with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar that appears when evidence items are selected, showing count and providing export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with selection checkboxes, type/platform filters, and navigation to detail views. Loads evidence from IndexedDB and shows icons, badges, and metadata for each item.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for adding evidence via real-time capture or file upload. Handles form inputs for evidence type, platform, region, neighborhood, and notes, then saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture with tabs for photo, audio, and video recording. Uses custom hooks for camera and media recording, displays live previews, and handles capture/recording controls with duration formatting.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication flow. Shows loading state during login and clears query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and updating loss profile data including daily earnings, work days per week, deactivation date, and platform. Loads existing profile data and submits updates via mutation hook.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts. Calculates loss projections at 10-day intervals based on the provided loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports. Generates text-based reports from loss profile data and handles file download or native sharing/clipboard copying.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated loss calculations. Uses calculation utilities to derive values from the loss profile and formats them as currency.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "React component that displays a clickable carousel banner showcasing platform features (evidence tracking, loss calculator, resource generator, etc.) with navigation controls and auto-advance functionality.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and image paths for desktop and mobile displays.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state and behavior including auto-advance timing, slide navigation, and pause/resume controls.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "React component that provides step-by-step instructions for configuring PagBank payment integration, including account setup, API credentials, and webhook configuration with SSL/HTTPS notices.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays appropriate messaging and actions when a payment provider is not configured, with different UI for admin vs regular users.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "React component that displays payment processing status (pending, completed, or failed) with appropriate UI, actions, and navigation options based on the payment flow state.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "React component that generates and displays a PIX QR code for payment, with copy-to-clipboard functionality for both the PIX key and payload, plus error handling and retry logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to set up their profile with name (required) and email (optional). Appears automatically when user profile is not found after authentication.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides UI controls to start/end work sessions with city selection, and automatically fetches and logs weather samples every 30 minutes during an active session.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with their city, timestamps, weather sample counts, and active status; clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Combines WorkSessionControls and WorkSessionsList into a single section with cards for managing and viewing work sessions.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Conditionally renders children based on user entitlement status, showing a locked state with upgrade prompts if the user lacks required subscription access.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog component for authenticated users to submit testimonials with quote, name, and role fields, including validation, error handling, and success confirmation.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Exports static testimonial data as fallback content, containing quotes, names, and roles of delivery workers.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays a grid of approved testimonials from the backend (or fallback static data), with a button to open the submit testimonial dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Data Protected, Secure Payment, 100% Trustworthy) with icons in a horizontal layout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admin operations: fetching all user access info, and blocking/unblocking users (backend methods not yet implemented).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Exports a mutation hook to update payment configuration (admin only) with error sanitization to avoid exposing sensitive backend data.",
  "frontend/src/hooks/useAppeals.ts": "Provides React Query hooks for generating appeals and fetching appeal data; all backend methods are not yet implemented and return placeholders.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages local storage-based progress tracking for blocked account help flow, including step navigation, completion tracking, and checklist items per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for case management (CRUD operations, attaching evidence/appeals) using client-side storage via casesStorage module.",
  "frontend/src/hooks/useCollectiveReports.ts": "Provides hooks for submitting and retrieving collective reports; backend methods are not implemented and return empty arrays or throw errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps useInternetIdentity to provide authentication status, principal ID, short ID, and logout functionality for the current user.",
  "frontend/src/hooks/useEvidence.ts": "Provides React Query hooks for evidence operations (upload, fetch, delete); backend methods are not implemented as evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state with mutations for creating payment sessions and checking payment status, including flow state tracking (idle, initiating, pending, completed, failed).",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) with localStorage persistence and toggle functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "React Query hook that checks if the current caller is an admin by calling the backend's isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides React Query hooks for fetching and setting user loss profiles, with the get method currently returning null as backend is not implemented.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using the MediaRecorder API, with controls for start, stop, pause, resume, cancel, and duration tracking.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file with no content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow state including session creation, status checking, and redirects to checkout URL with mutations for payment operations.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return and webhook URL configurations using React Query.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to get and set PagBank transparent checkout configuration using React Query.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration with caching and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch a 'reviso motivada' message, currently returning a placeholder as backend is not implemented.",
  "frontend/src/hooks/useSubscription.ts": "Fetches user subscription status and evaluates entitlements using business rules from the subscriptions library.",
  "frontend/src/hooks/useTestimonials.ts": "Manages testimonial CRUD operations including fetching approved/pending testimonials, submitting new ones, and updating status with admin controls and error sanitization.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile with React Query caching and invalidation.",
  "frontend/src/hooks/useWorkSessions.ts": "Manages work session operations including logging sessions, ending sessions, and adding weather samples, with most backend methods not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with brand-aligned color palette (orange/gold and navy blue) defined in CSS custom properties for light/dark modes and style variants.",
  "frontend/src/lib/canisterConfig.ts": "Provides functions to retrieve the backend canister ID from environment variables, window location (IC domains), or fallback to local development ID, and generates webhook URLs.",
  "frontend/src/lib/casesStorage.ts": "Manages case data in localStorage with functions to create, read, update cases, attach evidence/appeals, and maintain timeline events for each user principal.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides a function to retrieve neighborhoods for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages evidence media (images, audio, video) storage in IndexedDB with functions to store/retrieve media files and evidence metadata, including React hooks for media access.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses based on a worker's daily earnings and deactivation date.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support emails with encoded subjects and bodies.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage during checkout flow.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing errors by type and indicating if admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages with categorization for user vs. admin errors.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages with error type classification and admin action flags.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation and TLV formatting for static PIX payments.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/pagbank) in localStorage and determines active provider from public config with PagBank prioritized over gateway.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Dynamically loads qrcode library from CDN and generates QR code data URLs client-side without npm dependencies.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports for driver deactivation cases, calculating weekly, monthly, and accumulated earnings losses.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations including free 24h trial, monthly pro (R$29.99), and annual pro (R$329.90) with features and pricing.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status, calculates expiry and days remaining, and formats subscription information for display.",
  "frontend/src/lib/supportSummary.ts": "Generates case summaries and creates pre-filled support email links with case details including platform, block date, and evidence count.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of pre-written templates for appeals, driver rights documentation, evidence collection guides, and communication with platforms like iFood and Uber.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages, handling auth, admin-only, and not-found error cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps conditions to internal WeatherCondition enum with fallback defaults.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as ZIP archive; currently only logs evidence IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing users (blocking/unblocking), payment provider configuration (Gateway and PagBank), testimonials moderation, and viewing user access information with tabs and accordions.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters using a wizard interface, evidence picker, and AI generation; supports downloading appeals as text files or sending via email.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans, supporting both Gateway and PagBank providers with PIX QR code display, payment status tracking, and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated community data about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard landing page with navigation cards to key modules (evidence tracker, loss calculator, appeal generator, collective insights) and quick access shortcuts to payments, profile, and quick search.",
  "frontend/src/pages/DataPolicyPage.tsx": "Static page displaying the data policy and LGPD compliance information, explaining data treatment principles, legal bases, data categories, and processing purposes in a scrollable card layout.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Displays detailed view of a single evidence item with media preview (image, audio, or video), metadata badges, and navigation back to evidence list.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Main evidence tracker page with tabs for managing evidence uploads/timeline and work sessions, wrapped in authentication gate.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Page for calculating financial losses from platform deactivation, displaying results, projections, and report generation actions based on user's loss profile.",
  "frontend/src/pages/PaymentsPage.tsx": "Informational page showcasing available payment methods (PIX, credit card, bank slip) with trust badges and navigation to plans page.",
  "frontend/src/pages/PlansBillingPage.tsx": "Displays subscription plans with pricing, features comparison, current user entitlement status, and upgrade/checkout navigation.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Subscription management dashboard showing current plan status, expiry details, and side-by-side plan comparison with upgrade options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page with scrollable content detailing data collection, usage, storage, security, and user rights.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page that allows authenticated users to view and update their name, email, and view their Internet Identity Principal ID using forms and cards.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing the app's features (evidence tracker, loss calculator, appeal generator, collective data) with marketing banners, testimonials, trust badges, and A/B/C style variants for testing.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process/appeal lookup functionality with a search form and informational alerts about upcoming features like real-time tracking and judicial system integration.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Detail view page for a single work session showing start/end times, location, duration, weather conditions, and a table of deliveries with earnings and distances.",
  "frontend/src/types/backend-extended.ts": "TypeScript type definitions extending backend types with enums and interfaces for Region, EvidenceType, Evidence, ReasonCategory, Appeal, CollectiveReport, and PublicLossProfile that are missing from the generated backend interface.",
  "frontend/src/types/case.ts": "TypeScript interfaces defining the Case management data structure including CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus enum, and Case entity with creation parameters.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript module file, likely a placeholder for future Mercado Pago payment integration type definitions.",
  "frontend/src/types/qrcode.d.ts": "TypeScript ambient declarations for the QRCode library loaded via CDN, defining the global Window.QRCode interface with methods for generating QR codes as data URLs, canvas, or strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter), container settings, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a fix request for PIX QR code generation and display issues on the checkout page, with three existing features focused on fixing QR code rendering, debugging console errors, and verifying PIX key/payload retrieval."
}