{
  "backend/main.mo": "Main Motoko actor defining types for evidence tracking, work sessions, appeals, loss profiles, collective reports, user profiles, subscriptions, testimonials, and payment configurations for a gig worker rights platform.",
  "feature_evidence.json": "Feature evidence report documenting a single feature request to increase logo size in AppLayout header component, with high confidence and associated test ID REQ-2.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks with stubbed backend methods, IndexedDB storage, utility functions, and components using types from backend-extended, with OKLCH color system styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including black background, white foreground, and orange primary colors for the application.",
  "frontend/index.html": "HTML entry point with Portuguese language, PWA manifest, favicon references, theme color, and Google Fonts Inter preconnect for the ROTAS E DIREITOS application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and standalone display mode for ROTAS E DIREITOS mobile application.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router with routes for dashboard, evidence tracking, loss calculator, appeals, collective insights, plans, payments, profile, policies, and admin pages, plus ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "An admin panel for moderating testimonials, allowing approval or rejection of pending testimonials with status badges and formatted timestamps.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely a placeholder for MercadoPago payment integration setup instructions.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "A comprehensive form for configuring PagBank transparent checkout settings including payment types, credentials, installments, and return/webhook URLs.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Displays and manages PagBank webhook and return URLs, with auto-generated webhook URL and copy-to-clipboard functionality.",
  "frontend/src/components/AdminGate.tsx": "Access control component that verifies authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "An editor component for reviewing and modifying generated appeal text with download and email sending capabilities.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A wizard form for generating appeals by collecting platform, reason category, user explanation, and optional evidence IDs.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for selection, showing type badges, platform badges, and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that generates a mailto link for sending appeals via email, with an alert informing users they must manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with sticky header containing large logo (h-20 to h-28), mobile menu toggle, navigation items for authenticated users, and LoginButton integration.",
  "frontend/src/components/AuthGate.tsx": "A component that blocks access to children content until the user authenticates via Internet Identity, displaying a login prompt with customizable message.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A card component displaying a bar chart of collective report counts grouped by platform using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A card component displaying a pie chart showing the distribution of collective reports by reason category using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "A card component displaying a line chart showing the trend of collective reports over time grouped by month using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar component that appears when evidence items are selected, showing count and providing export and clear selection buttons.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "A timeline component displaying evidence items from IndexedDB with filtering, multi-selection via checkboxes, and integration with selection toolbar for bulk operations.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Form component for uploading evidence with tabs for real-time capture and file upload, supporting multiple evidence types (selfie, screenshot, audio, video) with metadata fields like platform, region, and notes. Saves evidence to IndexedDB and displays toast notifications.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Tabbed panel component for capturing real-time evidence (photo, audio, video) using camera and media recorder hooks. Displays video preview, recording controls with duration formatting, and handles capture completion callbacks.",
  "frontend/src/components/LoginButton.tsx": "A login/logout button component that manages Internet Identity authentication state and clears the query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and saving financial loss profile data including daily earnings, days per week, deactivation date, and platform. Uses React Query hooks to fetch and update caller's loss profile.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Recharts line chart component that visualizes projected earnings loss over 90 days based on a loss profile, calculating loss at 10-day intervals.",
  "frontend/src/components/loss/LossReportActions.tsx": "Action buttons component for downloading and sharing loss reports as text files, with fallback to clipboard copy if native share is unavailable.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Dashboard cards displaying calculated weekly, monthly, and accumulated loss metrics from a loss profile with icons and formatted currency values.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Carousel banner component showcasing platform features across 5 slides with navigation controls, auto-advance, and click-through to plans page. Supports three visual variants (A, B, C).",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Data file defining 5 banner slides with headlines, subheadlines, and image paths for desktop and mobile versions of the marketing carousel.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state for marketing banners, including auto-advance timer, manual navigation (next/prev/goTo), and pause/resume controls.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "Displays a step-by-step setup guide for PagBank payment integration, including account creation, API credentials retrieval for both standard and transparent checkout, and webhook configuration instructions.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays an alert when a payment provider is not configured, with admin-specific actions to navigate to settings or user-facing guidance to contact administrators.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Displays payment flow status (pending, completed, failed) with appropriate UI feedback, action buttons (retry, check status, navigate), and payment ID information for Gateway or PagBank providers.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to set up their profile with name (required) and email (optional) when no profile exists.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides UI controls to start/end work sessions with city selection, automatically fetches and logs weather samples every 30 minutes during active sessions.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with city, timestamps, weather sample counts, and active status badges; clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing active session state between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and displays upgrade prompts for expired or insufficient subscriptions, optionally requiring Pro tier access.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog component for submitting testimonials with form validation, authentication check via Internet Identity, and success/error state handling. Includes character limits and Portuguese UI text.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Defines the Testimonial interface and exports static fallback testimonial data for delivery workers in Portuguese.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials from backend or fallback static data in a grid layout with loading skeletons. Includes a button to open the submit testimonial dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Data Protection, Secure Payment, 100% Trustworthy) with icons in a horizontal layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with optional Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for admin operations including fetching all user access info and blocking/unblocking users (latter two not yet implemented in backend).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Mutation hook for updating payment configuration with error sanitization and validation, invalidating public payment config on success.",
  "frontend/src/hooks/useAppeals.ts": "Provides hooks for generating and fetching appeals with evidence, but all backend methods are not yet implemented.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages blocked account help progress state in localStorage per user principal, tracking steps, checklist items, and completion status.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for CRUD operations on cases stored in localStorage, including attaching evidence and appeals to cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Defines hooks for submitting and fetching collective reports by platform/region, but backend implementation is not available.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authentication state and user identity information (principalId, shortId) derived from Internet Identity, along with a logout function.",
  "frontend/src/hooks/useEvidence.ts": "Defines hooks for evidence management (getAllEvidence, uploadEvidence, deleteEvidence) but all backend methods are unimplemented; evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages generic payment gateway flow state (idle, initiating, pending, completed, failed) with mutations for creating payment sessions and checking payment status.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages a three-variant (A/B/C) style toggle for the homepage, persisting the selection in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to determine if the current caller has admin privileges using the isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set user loss profiles, though the get method is currently unimplemented and returns null.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for audio/video recording using MediaRecorder API, managing recording state, duration tracking, and returning recorded files.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file, likely a placeholder for MercadoPago payment integration.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow with mutations for creating payment sessions (redirecting to checkout URL) and checking payment status, updating subscription on completion.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return and webhook URL configuration for payment processing.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to get and set PagBank transparent checkout configuration for embedded payment flows.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration from the backend with caching and retry logic.",
  "frontend/src/hooks/useQueries.ts": "Provides a query hook for fetching a 'reviso motivada' message, though the backend method is unimplemented and returns a placeholder string.",
  "frontend/src/hooks/useSubscription.ts": "Queries user subscription status from the backend and evaluates entitlement rules to determine feature access levels.",
  "frontend/src/hooks/useTestimonials.ts": "React Query hooks for managing testimonials: fetching approved/pending testimonials, submitting new testimonials, and updating testimonial status (admin only). Includes error sanitization and query invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the caller's user profile, with query invalidation on successful save.",
  "frontend/src/hooks/useWorkSessions.ts": "React Query hooks for work session management (logging, ending, weather samples, fetching). Most backend methods are not yet implemented and throw placeholder errors.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a black background with orange/white color scheme, including dark mode and alternative style variants (teal/cyan and warm sunset).",
  "frontend/src/lib/canisterConfig.ts": "Utility functions to retrieve the backend canister ID from environment variables or window location, and generate webhook URLs for PagBank integration.",
  "frontend/src/lib/casesStorage.ts": "LocalStorage-based CRUD operations for case management, including creating cases, updating status, attaching evidence/appeals, and managing timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines available regions (Fortaleza, Caucaia, Maracanaú) and provides a function to retrieve neighborhoods for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "IndexedDB wrapper for storing and retrieving evidence media (images, audio, video) and metadata, with React hooks for accessing stored media as object URLs.",
  "frontend/src/lib/lossCalculations.ts": "Utility functions to calculate weekly, monthly, accumulated, and projected financial losses based on a public loss profile.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support emails with pre-filled subject and body content.",
  "frontend/src/lib/payments/checkoutState.ts": "SessionStorage utilities for persisting and retrieving the selected subscription plan during checkout flow.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing them by type (provider disabled, authentication, declined, timeout, etc.) and indicating whether admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages, handling provider configuration issues, authentication failures, payment declines, and webhook validation errors.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages, categorizing errors by type and providing admin-specific guidance for configuration issues.",
  "frontend/src/lib/payments/pixPayload.ts": "Empty file with no content.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway or pagbank) using localStorage for UI state, determines active provider from public config, and provides utilities for reading/writing provider preferences.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports for driver deactivation cases, calculating weekly, monthly, and accumulated losses based on profile data and formatting them into a downloadable blob.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free 24h, pro monthly, pro annual) with pricing, features, and billing periods, providing lookup utilities for plan details.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status from backend data, calculating expiry, trial/pro status, and days remaining, with formatting utilities for displaying expiry dates.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries and mailto links for support emails, including case details like platform, block date, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of pre-written templates for appeals, driver rights information, evidence collection guides, and communication templates, organized by category and platform.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes testimonial submission errors into safe English messages, handling authentication failures, authorization issues, not-found errors, and generic failures.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps weather conditions to internal WeatherCondition enum types.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently only logs evidence IDs to console.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for user management (blocking/unblocking), payment configuration (Gateway/PagBank providers), and testimonial moderation, protected by AdminGate.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters using a wizard interface, evidence picker, and AI generation with download and email sharing options.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans using either Gateway or PagBank providers based on configuration, with status tracking and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated statistics about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard landing page with navigation cards for core modules (evidence tracker, loss calculator, appeal generator, collective data) and quick access shortcuts.",
  "frontend/src/pages/DataPolicyPage.tsx": "Displays a comprehensive data policy page explaining LGPD compliance, data categories collected (personal, work, financial, evidence), treatment principles, user rights, and data retention policies in Portuguese.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Shows detailed view of a single evidence item retrieved from IndexedDB, displaying metadata (type, platform, region), upload time, and rendering the media content (image, audio, or video) based on evidence type.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Main evidence tracking page with tabs for 'Evidências' (evidence upload form and timeline) and 'Jornadas' (work sessions), wrapped in AuthGate requiring user authentication.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Calculates and displays financial losses from platform deactivation, showing a loss profile form, results cards, projection chart, and report generation actions when profile data exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays available payment methods (PIX, credit card, bank slip) with descriptions and navigates users to the plans page to begin subscription checkout.",
  "frontend/src/pages/PlansBillingPage.tsx": "Shows subscription plans with pricing, features comparison, current subscription status, and handles plan upgrades by navigating to checkout with selected plan ID.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Displays user's current subscription details (plan name, expiry date, days remaining) and provides a comparison grid of all available plans with upgrade functionality.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays a privacy policy page with sections on data collection, usage, storage, security, and user rights. Uses Card components with a scrollable area to present legal information in Portuguese.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to view and edit their name and email. Integrates with Internet Identity and displays the user's Principal ID.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing app features (evidence tracker, loss calculator, appeal generator, collective data) with marketing banners, testimonials, and a style variant toggle. Includes navigation to pricing and privacy pages.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality where users can search for administrative appeals and legal processes by number. Currently shows a development notice and planned features.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, and weather conditions. Fetches session data by ID from route parameters.",
  "frontend/src/types/backend-extended.ts": "Defines TypeScript types and enums (Region, EvidenceType, ReasonCategory, Evidence, Appeal, CollectiveReport, PublicLossProfile) that extend or supplement the backend interface definitions.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus, and CreateCaseParams for tracking deactivation cases and appeals.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript file, likely a placeholder for future Mercado Pago payment integration type definitions.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file, likely a placeholder for QR code library type definitions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and custom design tokens for a component library.",
  "project_state.json": "Project metadata tracking one existing feature to increase logo size in the AppLayout header component, with no new feature requests or known issues."
}