{
  "backend/main.mo": "Main Motoko actor defining all types (Evidence, Appeal, WorkSession, LossProfile, Testimonial, PaymentConfig, etc.) and integrating MixinAuthorization and AccessControl for the backend canister.",
  "feature_evidence.json": "Feature evidence report documenting two PIX QR code related features with associated files, components, and test IDs for build planning.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including hooks, components, pages, and utilities, noting stubbed implementations and type imports from backend-extended.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, and sidebar colors.",
  "frontend/index.html": "HTML entry point with Portuguese locale, PWA manifest, favicon references, theme color, and Google Fonts Inter preload.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and standalone display mode for ROTAS E DIREITOS application.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router with routes for dashboard, evidence, sessions, loss calculator, appeals, collective insights, plans, payments, profile, policies, and admin, plus ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials with approve/reject actions. Displays pending testimonials with status badges, timestamps, and parsed content (quote, name, role).",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely placeholder for MercadoPago payment integration setup guide component.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types (credit/debit card, PIX, boleto), installments, and return/webhook URLs with validation.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Component displaying auto-generated webhook URL for PagBank integration with copy-to-clipboard functionality and input field for configuring return URL after payment completion.",
  "frontend/src/components/AdminGate.tsx": "Authorization component that checks authentication and admin status, displaying appropriate loading, access denied, or restricted access messages before rendering admin-only children.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editor component for reviewing and editing generated appeal text with download as .txt file and email sending capabilities. Loads appeal data by ID and platform.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and selected evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and platform labels for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that opens a mailto link for sending appeals via email, with an alert warning users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component providing header, navigation sidebar, and mobile menu with authenticated/unauthenticated states. Includes navigation items for dashboard, evidence, calculator, resources, collective data, profile, plans, and legal pages with admin-specific routes.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt when user is not authenticated, otherwise renders children. Shows customizable message and login button using Internet Identity.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A card component displaying a bar chart of collective report counts grouped by platform using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A card component displaying a pie chart showing the distribution of block reasons across collective reports using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "A card component displaying a line chart showing the monthly trend of collective reports over time using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar that appears when evidence items are selected, showing count and providing export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with selection checkboxes, type/platform filters, and navigation to detail views. Loads evidence from IndexedDB and shows icons, badges, and metadata for each item.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for adding evidence via real-time capture or file upload. Handles form inputs for evidence type, platform, region, neighborhood, and notes, then saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture with tabs for photo, audio, and video recording. Uses custom hooks for camera and media recording, displays preview streams, and handles capture/recording controls with duration tracking.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component using Internet Identity authentication. Handles login, logout with query cache clearing, and displays appropriate loading states.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and updating loss profile data including daily earnings, work days per week, deactivation date, and platform. Loads existing profile data and submits updates via mutation hook.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts. Calculates loss projections at 10-day intervals based on the user's loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports. Generates text-based reports from loss profile data and handles native sharing or clipboard fallback.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated loss calculations. Uses calculation utilities to derive values from the loss profile.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "React component that displays an auto-rotating carousel banner showcasing platform features (evidence tracking, loss calculator, etc.) with navigation controls and click-through to plans page.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and desktop/mobile image paths.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state with auto-advance timer, manual navigation, and pause/resume functionality.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "Displays a step-by-step guide for configuring PagBank payment integration, including account setup, API credentials, and webhook configuration instructions.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays an alert when a payment provider is not configured, with role-based messaging and admin navigation button.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Displays payment flow status (pending, completed, failed) with appropriate UI feedback, action buttons, and navigation options based on payment state.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "Generates and displays a PIX QR code for payment with copy-to-clipboard functionality for both the PIX key and payload string.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to set up their profile with name (required) and email (optional). Appears automatically when user profile is not found after authentication.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "React component that provides UI controls to start/end work sessions, select a city, and automatically fetch and log weather samples every 30 minutes during an active session.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with their city, timestamps, weather sample counts, and active status; clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session ID state shared between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and displays a locked state with upgrade prompts if the user lacks required subscription access (basic or pro).",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog form for authenticated users to submit testimonials with quote, name, and role fields; includes validation, error handling, and success confirmation.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Exports static testimonial data as a fallback array of quotes, names, and roles from delivery workers.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays a grid of approved testimonials from the backend (or fallback static data), with loading skeletons and a button to open the submission dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Data Protected, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admin operations including fetching all user access info and blocking/unblocking users (block/unblock functionality not yet implemented in backend).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Exports a mutation hook for updating payment configuration (admin only) with error sanitization to avoid exposing sensitive backend data.",
  "frontend/src/hooks/useAppeals.ts": "Provides React Query hooks for generating appeals and fetching appeal data; all backend methods are not yet implemented and return placeholder errors/empty data.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages local storage-based progress tracking for blocked account help flow, including step navigation, completion tracking, and checklist items per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for CRUD operations on cases stored in client-side storage (casesStorage), including creating, updating, and attaching evidence/appeals to cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Provides hooks for submitting and retrieving collective reports; backend implementation is not available so operations throw errors or return empty arrays.",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps useInternetIdentity to provide simplified access to current user authentication state, principal ID, and logout functionality.",
  "frontend/src/hooks/useEvidence.ts": "Provides React Query hooks for evidence operations (upload, fetch, delete); backend methods are not implemented as evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state with mutations for creating payment sessions and checking payment status, including state management for the payment lifecycle.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages localStorage-persisted homepage style variant selection (A, B, or C) with toggle functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useIsAdmin.ts": "React Query hook that checks if the current caller has admin privileges by calling the backend's isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides React Query hooks for fetching and setting user loss profiles, though the backend method for fetching is not yet implemented.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using the MediaRecorder API with controls for start, stop, pause, resume, and cancel operations.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file with no content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow state including session creation, payment status checking, and subscription invalidation on successful payment.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return and webhook URL configurations with query invalidation on updates.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to fetch and update PagBank transparent checkout configuration with query cache management.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration with caching and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch a reviso motivada message, though the backend method is not yet implemented.",
  "frontend/src/hooks/useSubscription.ts": "Fetches user subscription status and evaluates entitlements using business rules from the subscriptions library.",
  "frontend/src/hooks/useTestimonials.ts": "Manages testimonial operations including fetching approved/pending testimonials, submitting new ones, and updating status with admin controls and error sanitization.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile with query cache invalidation.",
  "frontend/src/hooks/useWorkSessions.ts": "Manages work session operations including logging sessions, ending sessions, and adding weather samples, though some backend methods are not yet implemented.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a black background theme with orange accents, including dark mode and alternative color scheme variants (teal and warm sunset).",
  "frontend/src/lib/canisterConfig.ts": "Provides functions to retrieve the backend canister ID from environment variables, window location (IC domains), or fallback, and generates webhook URLs for PagBank integration.",
  "frontend/src/lib/casesStorage.ts": "Manages case data in localStorage with functions to create, read, update cases, attach evidence/appeals, and maintain timeline events for each user principal.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides neighborhood lists mapped to each region for collective action forms.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages evidence media (images, audio, video) and metadata storage in IndexedDB with hooks for retrieving media URLs and legacy image support functions.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses for delivery workers based on their public loss profile data.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support contacts with pre-filled subjects and bodies.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage during checkout flow with save, get, and clear functions.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing errors by type and indicating if admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages with categorization for user errors vs. admin configuration issues.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user messages with typed error categories and admin action flags.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation and TLV formatting for static PIX payments.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/pagbank) in localStorage and determines active provider from public config with PagBank prioritized over gateway.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Generates QR code images as data URLs using the qrserver.com public API without requiring additional npm dependencies.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports for driver profiles including weekly, monthly, and accumulated loss calculations.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free 24h, pro monthly, pro annual) with pricing, features, and billing periods.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status including trial/pro status, expiration, and remaining days, plus formats expiry dates for display.",
  "frontend/src/lib/supportSummary.ts": "Generates case summaries and creates pre-filled support email links with case details, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of appeal templates, driver rights information, and evidence collection guidelines organized by category and platform.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages for auth, admin, and not-found scenarios.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps conditions to internal WeatherCondition enum.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as ZIP; currently only logs evidence IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for user management (block/unblock), payment provider configuration (gateway/PagBank), and testimonial moderation with save/refetch logic.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters with wizard-based input, evidence picker, and options to download or email the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans, supporting both Gateway and PagBank providers with PIX QR code display and payment status tracking.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated community data about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with navigation cards to key modules (evidence tracker, loss calculator, appeal generator, collective insights) and quick access shortcuts.",
  "frontend/src/pages/DataPolicyPage.tsx": "Static page displaying the data policy and LGPD compliance information, explaining data categories, legal basis, and treatment purposes.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view for a single evidence item, displaying metadata, badges, and rendering media content (image, audio, or video) from IndexedDB.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Main page for evidence tracking with tabs for evidence uploads/timeline and work sessions. Wraps content in AuthGate requiring authentication.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Page for calculating financial losses from deactivation, displaying a form, results cards, projection chart, and report actions. Shows placeholder when no profile exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Informational page displaying available payment methods (PIX, credit card, bank slip) with trust badges and a CTA to view plans.",
  "frontend/src/pages/PlansBillingPage.tsx": "Subscription plans page showing current user entitlement status and all available plans with features, pricing, and upgrade buttons. Includes trust badges and highlights recommended plan.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Subscription management dashboard displaying current subscription details (expiry, status) and plan comparison grid with upgrade options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page with scrollable content covering data collection, usage, storage, security, and user rights in Portuguese.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page with form for updating name and email, plus display of Internet Computer Principal ID. Uses profile hooks for data fetching and saving.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page displaying features (evidence tracker, loss calculator, appeal generator, collective data), trust badges, testimonials, and a style variant toggle (A/B/C) for homepage layout experimentation.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality where users can search and track administrative appeals and judicial processes by number; currently shows a development notice.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, weather conditions, and associated deliveries in a table format.",
  "frontend/src/types/backend-extended.ts": "Extends backend types with frontend-specific enums and interfaces (Region, EvidenceType, Evidence, ReasonCategory, Appeal, CollectiveReport, PublicLossProfile) that are missing from the backend interface.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus, and CreateCaseParams for tracking deactivation cases.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript declaration file for MercadoPago payment integration types.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file for QR code library type definitions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and sidebar theming support.",
  "project_state.json": "Project state metadata indicating an e-commerce application with PIX payment integration, tracking a bug fix request for PIX QR code display in checkout flow."
}