{
  "backend/main.mo": "Main actor defining all data types (Evidence, Appeal, WorkSession, LossProfile, Subscription, Testimonial, PaymentConfig, etc.) and implementing storage mixins for blob storage and authorization with migration support.",
  "backend/migration.mo": "Migration module that transfers subscriptions data from old actor schema to new schema, dropping the userAccess field during migration.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: transparent checkout cart component, updated subscription plan pricing (Free/PRO Monthly R$29.99/PRO Annual R$119.99), and redesigned plan comparison section.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, components, and utilities, noting many backend methods are stubbed since they don't exist in the actual backend implementation.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system featuring vibrant orange primary, deep navy secondary, and comprehensive light/dark mode support with brand-aligned color palette.",
  "frontend/index.html": "HTML entry point with PWA manifest, theme color configuration, Google Fonts (Outfit and Inter), and Nova logo favicon references.",
  "frontend/public/manifest.webmanifest": "PWA manifest for 'ROTAS E DIREITOS' app with standalone display mode, brand colors, and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router with all application routes including home, dashboard, evidence tracking, appeals, payments, checkout, profile, quick access, admin, and policy pages, plus ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials, displaying pending submissions with approve/reject actions, status badges, and formatted timestamps with JSON content parsing.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely a placeholder for MercadoPago payment integration setup documentation or guide component.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types (credit/debit/PIX/boleto), installment options, and return/webhook URLs with validation.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "React component that displays and manages PagBank webhook and return URLs, with auto-generated webhook URL display and copy-to-clipboard functionality.",
  "frontend/src/components/AdminGate.tsx": "A React component that restricts access to admin-only areas by checking authentication and admin status, displaying appropriate error messages or loading states, and rendering children only for authenticated admins.",
  "frontend/src/components/appeal/AppealEditor.tsx": "React component for editing generated appeal text with download and email send functionality, fetches appeal data by ID and allows text modifications.",
  "frontend/src/components/appeal/AppealWizard.tsx": "Form wizard component for generating appeals, collecting platform, reason category, user explanation, and evidence IDs before submission.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "Component for selecting evidence items from IndexedDB with checkboxes, displaying evidence type badges and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "Button component that opens a mailto link with pre-filled appeal content and displays an alert about manually attaching evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component providing a sticky header with logo and login button, responsive mobile menu with navigation items (dashboard, evidence, calculator, resources, etc.), and account/legal links organized by category.",
  "frontend/src/components/AuthGate.tsx": "A simple authentication gate component that displays a login prompt with customizable message when user is not authenticated, otherwise renders its children.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "Filter component with three dropdowns for platform, region, and reason category selection to filter collective reports.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "Form component for anonymously submitting collective reports about platform experiences, with platform, region, neighborhood, and reason fields.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "Chart component that displays a bar chart showing the distribution of collective reports across different platforms using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "Displays a pie chart showing the distribution of block reasons from collective reports, with Portuguese labels for each reason category.",
  "frontend/src/components/collective/TrendChart.tsx": "Renders a line chart showing the monthly trend of collective reports over time, grouping reports by year-month.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "Provides dropdown filters for evidence type and platform, allowing users to filter evidence lists.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "Shows a toolbar when evidence items are selected, offering export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with checkboxes for selection, supporting bulk export and navigation to detail views.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for uploading evidence via file selection or real-time capture, with metadata fields for platform, region, and notes.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture (photo, audio, video) using camera and media recorder hooks, with recording controls and duration display.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout with loading states, clearing query cache on logout, and error handling for authentication edge cases.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form for entering and saving financial loss profile data including daily earnings, work days per week, deactivation date, and platform.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts, calculating data points at 10-day intervals from a loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports, generating text-based reports as downloadable files or sharing via Web Share API with clipboard fallback.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three cards showing weekly, monthly, and accumulated loss calculations with icons and formatted currency values in Brazilian Reais.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Interactive carousel banner showcasing five platform features (evidence tracking, loss calculator, resource generator, insights, security) with navigation controls and auto-advance functionality.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and placeholder image paths for desktop and mobile.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook managing carousel state with auto-advance timer, manual navigation controls, and pause/resume functionality for marketing banner slides.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "Comprehensive setup guide component for PagBank payment integration, displaying step-by-step instructions for account creation, API credentials, webhook configuration, and SSL/HTTPS information.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Displays an alert when payment provider is not configured, showing admin-specific configuration prompts or user-facing contact messages based on role.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Renders payment flow status UI with different states (pending, completed, failed), showing appropriate alerts, actions, and navigation buttons based on payment processing state.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "Displays a PIX QR code for payment with copy-to-clipboard functionality for both the PIX key and payload, includes loading states, error handling, and retry mechanism.",
  "frontend/src/components/payments/TransparentCheckoutCart.tsx": "Shows a checkout cart summary with selected subscription plan details, features, limitations, and a payment button for card transactions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that appears for new users to collect profile information (name, email, platform, region, phone), preventing dismissal until the required name field is submitted.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides controls to start/end work sessions with city selection and automatically fetches weather samples every 30 minutes during active sessions.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with timestamps, city, weather sample counts, and active session badges; sessions are clickable to view details.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session state between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Guards features based on subscription entitlement, showing an upgrade prompt with navigation to plans page when access is denied or subscription is expired.",
  "frontend/src/components/subscription/PlanComparisonMatrix.tsx": "Displays a comparison matrix of subscription plans with features, pricing, and selection buttons; handles both mobile card view and desktop table view.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog component for submitting testimonials with form validation, authentication check via Internet Identity, and success/error state handling. Includes character limits and Portuguese UI text.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Defines the Testimonial interface and exports static testimonial data for delivery workers from various platforms (iFood, Uber, Rappi, 99).",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials in a grid layout with loading skeletons, falling back to static data if no backend testimonials exist. Includes a button to open the submit testimonial dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust badges (Protected Data, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes and invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin hooks for user access management (getAllUserAccessInfo, blockUser, unblockUser) with placeholder implementations that throw 'not implemented' errors.",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Mutation hook for updating payment configuration with error sanitization to prevent exposing sensitive backend data. Includes validation error handling.",
  "frontend/src/hooks/useAppeals.ts": "Provides hooks for appeal generation and retrieval (generateAppeal, getAppeal, getCallerAppeals) with placeholder implementations that throw 'not implemented' errors.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages local storage-based progress tracking for blocked account help flow, including step navigation, completion tracking, and checklist items per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for case management (CRUD operations, attaching evidence/appeals) using local storage via casesStorage module, scoped by user principal.",
  "frontend/src/hooks/useCollectiveReports.ts": "Provides hooks for submitting and retrieving collective reports by platform/region, with placeholder implementations that return empty arrays or throw 'not implemented' errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authentication state and user identity information (principalId, shortId) by wrapping useInternetIdentity, exposing isAuthenticated flag and logout function.",
  "frontend/src/hooks/useEvidence.ts": "Defines React Query hooks for evidence management (getAllEvidence, uploadEvidence, deleteEvidence) but all backend methods are unimplemented; evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages generic payment gateway flow state (idle, initiating, pending, completed, failed) with mutations for creating sessions and checking status, but backend methods are not yet implemented.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) persisted to localStorage with a toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider, managing login/logout flow, identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to check if the current caller has admin privileges using the isCallerAdmin actor method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set user loss profiles; getCallerLossProfile returns null as backend method is unimplemented, but setLossProfile calls the actor method.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook wrapping browser MediaRecorder API for audio/video recording with state management for recording, pausing, resuming, and duration tracking, returning recorded files as Blobs.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file with no implementation.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow state with mutations for creating sessions and checking status, including redirect to checkout URL, but backend methods are not yet implemented.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return/webhook URL configuration via backend actor methods with query invalidation on updates.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to get and set PagBank transparent checkout configuration via backend actor methods with query invalidation on updates.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration from backend with caching and retry logic.",
  "frontend/src/hooks/useQueries.ts": "Provides a query hook for fetching reviso motivada message, but backend method is unimplemented and returns placeholder text.",
  "frontend/src/hooks/useSubscription.ts": "Provides React hooks for fetching subscription status and evaluating entitlements, with a placeholder implementation returning a default free plan.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for fetching, submitting, and updating testimonials with admin approval workflow, including error sanitization and cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile using React Query with automatic cache invalidation.",
  "frontend/src/hooks/useWorkSessions.ts": "Defines React Query hooks for logging, ending, and fetching work sessions with weather samples, though most backend methods are not yet implemented.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a modern design system using OKLCH color space, featuring emerald green primary, coral secondary, and teal accent colors with dark mode and style variants.",
  "frontend/src/lib/canisterConfig.ts": "Provides functions to determine the canister ID from environment variables or URL hostname and generate webhook URLs for the IC deployment.",
  "frontend/src/lib/casesStorage.ts": "Implements localStorage-based CRUD operations for case management, including evidence and appeal linking with timeline tracking.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides a function to retrieve neighborhoods for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages IndexedDB storage for evidence media (images, audio, video) and metadata with React hooks for retrieval and URL generation.",
  "frontend/src/lib/lossCalculations.ts": "Provides utility functions to calculate weekly, monthly, accumulated, and projected financial losses based on a user's loss profile.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support contacts with URL-encoded subjects and bodies.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage for checkout flow persistence.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing them by type (provider disabled, authentication failed, payment declined, etc.) and indicating whether admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages, handling configuration issues, authentication failures, payment declines, and webhook validation errors with admin action flags.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages with typed error categories and admin action indicators, including role-based messaging for unconfigured providers.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation, TLV formatting, and a fixed payload generator for the application's PIX key.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/pagbank) in localStorage and determines the active provider from public config, prioritizing PagBank over gateway when both are enabled.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Dynamically loads qrcode library from CDN and generates QR code data URLs client-side with configurable size and high error correction level.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports as Blobs containing platform details, deactivation date, earnings, and calculated weekly/monthly/accumulated losses.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free 24h, pro monthly, pro annual) with pricing, features, defense limits, and helper function to retrieve plans by ID.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status from subscription data, calculating expiry, days remaining, and plan type flags (trial/pro/expired), plus date formatting utilities.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries and creates pre-filled support email links with case details including platform, block date, reason, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Defines template data structures and exports a library of pre-written appeal templates, driver rights information, and evidence collection guides for various gig platforms (iFood, Uber) and deactivation reasons.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Provides a centralized error sanitizer that converts raw testimonial mutation errors into user-friendly English messages, handling auth, admin-only, not-found, and generic errors.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps weather conditions to internal WeatherCondition enum, with fallback to default values on error.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently only logs evidence IDs to console.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for user management (block/unblock), payment configuration (Gateway/PagBank providers), and testimonial moderation, protected by AdminGate component.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters using a wizard interface, evidence picker, and AI generation; supports downloading and emailing the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans, supporting both Gateway and PagBank providers with PIX QR code display, status checking, and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays aggregated anonymous community data about gig worker deactivations with filtering by platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying module cards (Evidence Tracker, Loss Calculator, Resource Generator, Collective Data) and quick access buttons (Payments, Profile, Quick Consultation) with icons and navigation links.",
  "frontend/src/pages/DataPolicyPage.tsx": "Data policy page explaining LGPD compliance, legal bases for data processing, categories of collected data (personal, work, financial, evidence), and treatment purposes in a scrollable card layout.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view page for a single evidence item, displaying metadata (type, platform, region, upload time) and rendering media content (image, audio, or video) based on evidence type.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Evidence tracker page with tabbed interface for managing evidence uploads and work sessions, wrapped in AuthGate for authenticated access only.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing platform features (Evidence Tracker, Loss Calculator, Resource Generator, Collective Data), benefits, and plan comparison matrix with hero section and logo.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Loss calculator page displaying a form to input loss profile data and showing calculated results, projection charts, and report generation actions when profile exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Payments information page displaying available payment methods (PIX, credit card, bank slip) with trust badges and a call-to-action button to view subscription plans.",
  "frontend/src/pages/PlansBillingPage.tsx": "Displays subscription plans with pricing, features, and upgrade options. Shows current subscription status, trial/expiry badges, and handles plan selection for checkout.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Subscription management dashboard showing current plan status, expiry dates, and a comparison grid of available plans. Provides upgrade navigation to checkout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page displaying data collection practices, usage, storage, security measures, and user rights in a scrollable card layout.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management form allowing users to update personal information including name, email, platform, region, and phone number with validation and save functionality.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Marketing landing page showcasing app features (evidence tracking, loss calculator, resource generator, collective data) with hero section, testimonials, plan comparison, and A/B/C style variants.",
  "frontend/src/pages/QuickAccessPage.tsx": "React page component that provides quick access links to driver/delivery platform apps (Uber, 99, iFood) with deep linking to mobile apps and fallback to web URLs. Requires authentication and redirects unauthenticated users to home.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process/appeal lookup functionality with a search form and informational alerts about upcoming features like real-time status tracking and judicial system integration.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, and weather conditions, with navigation back to the evidence list.",
  "frontend/src/types/backend-extended.ts": "TypeScript type definitions extending backend types with enums and interfaces for Evidence, Appeals, Subscriptions, Testimonials, Payments, and other domain models not exported from the backend canister interface.",
  "frontend/src/types/case.ts": "TypeScript interfaces defining the Case management data model including case status, timeline events, evidence attachments, appeals, and creation parameters for tracking platform block incidents.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript module file, likely intended for Mercado Pago payment integration type definitions.",
  "frontend/src/types/qrcode.d.ts": "TypeScript ambient declarations for the QRCode library loaded via CDN, defining the global Window.QRCode interface with methods for generating QR codes as data URLs, canvas, or strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended font families (Outfit, Inter), container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for an e-commerce/subscription application with defense credits system. Contains three existing features related to checkout redesign, subscription plan updates (Free/PRO Monthly/PRO Annual tiers), and home page plan comparison UI improvements."
}