{
  "backend/main.mo": "Main Motoko actor defining all data types (Evidence, WorkSession, Appeal, LossProfile, Testimonial, PaymentConfig, etc.) and implementing authorization mixins for access control and user management in a gig worker rights platform.",
  "feature_evidence.json": "Feature evidence report documenting four completed features for UI theming: black background, orange/white color scheme, logo integration, and Tailwind CSS configuration updates.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, utilities, and components, noting many backend methods are stubbed/unimplemented and types are imported from backend-extended.",
  "frontend/index.css": "Tailwind CSS global styles defining OKLCH color system with black background (oklch(0 0 0)), vibrant orange primary (oklch(0.65 0.20 45)), and white foreground (oklch(1 0 0)) for both light and dark modes.",
  "frontend/index.html": "HTML entry point with Portuguese locale, PWA manifest, favicon/app-icon links, theme color metadata, and Google Fonts preconnect for Inter font family.",
  "frontend/public/manifest.webmanifest": "PWA manifest for \"ROTAS E DIREITOS\" app with standalone display mode, theme color #1a2332, and icon definitions for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (dashboard, evidence, loss calculator, appeals, collective insights, plans, payments, profile, policies, admin) with AppLayout wrapper and ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials, allowing approval or rejection of pending submissions with status badges and timestamp display.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty component file for MercadoPago payment integration setup guide.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including payment types, installments, credentials, and return/webhook URLs.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Component displaying auto-generated webhook URL for PagBank integration with copy-to-clipboard functionality and return URL configuration.",
  "frontend/src/components/AdminGate.tsx": "Authorization guard component that checks authentication and admin status using useIsAdmin hook, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Text editor component for reviewing and editing generated appeal text with download and email sending capabilities.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that opens a mailto link for sending appeals via email, with an alert reminding users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component providing responsive navigation with header, mobile menu, sidebar navigation for authenticated users, and sections for main nav, account, and legal links.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt when user is not authenticated, otherwise renders children content.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success feedback after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A card component displaying a bar chart that visualizes the distribution of collective reports across different platforms.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A card component displaying a pie chart that shows the distribution of collective reports by reason category with labeled percentages.",
  "frontend/src/components/collective/TrendChart.tsx": "A card component displaying a line chart that shows the trend of collective reports over time, grouped by month.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar component that appears when evidence items are selected, showing selection count and providing export and clear actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with selection checkboxes, type/platform filters, and navigation to detail views. Loads evidence from IndexedDB and shows icons, badges, and metadata for each item.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for adding evidence via real-time capture or file upload. Handles form inputs for evidence type, notes, platform, region, and neighborhood, then saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture with tabs for photo, audio, and video recording. Uses custom hooks for camera and media recording, displaying live previews and recording controls with duration timers.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication flow with loading states and error handling.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and updating loss profile data including daily earnings, work days per week, deactivation date, and platform. Loads existing profile data and submits updates via mutation hook.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts. Calculates loss projections at 10-day intervals based on the user's loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports. Generates text reports via PDF utility and handles native sharing or clipboard fallback.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated loss calculations. Uses calculation utilities to derive values from the loss profile.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "A clickable carousel banner component that displays marketing slides with headlines, subheadlines, and platform badges, featuring navigation controls and auto-advance functionality that navigates to the plans page on click.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the BannerSlide interface and exports an array of five marketing slides with headlines, subheadlines, and image paths for desktop and mobile versions.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "A custom React hook that manages carousel state with auto-advance, manual navigation, and pause/resume functionality using timers and callbacks.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "A comprehensive setup guide component that displays step-by-step instructions for configuring PagBank payment integration, including account creation, API credentials, webhook setup, and SSL/HTTPS information.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "A reusable component that displays an alert when a payment provider is not configured, showing different messages and actions for admin vs. non-admin users.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "Displays payment status UI with different states (pending, completed, failed) including appropriate icons, messages, and action buttons for payment flow management.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to set up their profile with name (required) and email (optional) fields on first login.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Manages work session controls with city selection, start/stop buttons, and automatic weather sampling every 30 minutes during active sessions using React Query mutations.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of work sessions with loading and empty states, showing session details like city, timestamps, weather samples, and active status badges. Clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session ID state and providing the main UI for work session management.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and subscription status, blocking features for expired or insufficient subscriptions with a call-to-action to upgrade.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog form for authenticated users to submit testimonials with validation for quote, name, and role fields, showing success/error states and requiring Internet Identity login.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Defines the Testimonial interface and exports static testimonial data with quotes from delivery workers about using the platform.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials in a grid layout with loading skeletons, falling back to static testimonial data if no backend testimonials exist, and includes a submit dialog button.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust indicator badges (Data Protection, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin hooks for fetching all user access info and blocking/unblocking users, though block/unblock mutations throw not-implemented errors.",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Provides a mutation hook to update payment configuration with error sanitization and validation, invalidating public payment config on success.",
  "frontend/src/hooks/useAppeals.ts": "Defines hooks for generating appeals and fetching appeal data, but all backend methods throw not-implemented errors as the functionality is not yet available.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages blocked account help flow progress (steps, checklist items) with localStorage persistence per user principal, providing functions to navigate steps, mark completion, and toggle checklist items.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for CRUD operations on cases stored in client-side storage, including fetching all cases, getting by ID, creating, updating, and attaching evidence/appeals to cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Defines hooks for submitting and retrieving collective reports by platform/region/neighborhood, though backend implementation is not yet available (returns empty arrays and throws errors).",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps Internet Identity hook to provide simplified user authentication state including authentication status, principal ID, short ID, and logout function.",
  "frontend/src/hooks/useEvidence.ts": "Provides React Query hooks for evidence management (upload, fetch, delete) with various metadata types, though backend methods are not implemented and evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state machine (idle, initiating, pending, completed, failed) with mutations to create payment sessions and check payment status, invalidating subscription queries on success.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) with localStorage persistence and provides a toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login flow, identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "React Query hook that checks if the current caller has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set user loss profiles via backend actor, though the get method is not yet implemented and returns null.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook wrapping browser MediaRecorder API for audio/video recording with state management for recording status, duration tracking, pause/resume controls, and error handling.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "File appears to be empty or truncated in the provided content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Custom React hook managing PagBank payment flow state (idle, initiating, pending, completed, failed) with mutations for creating payment sessions and checking payment status.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "React Query hooks for fetching and updating PagBank return/webhook URL configuration via actor methods.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "React Query hooks for fetching and updating PagBank transparent checkout configuration via actor methods.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "React Query hook to fetch public (non-sensitive) payment provider configuration with 30-second cache.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for fetching reviso motivada message; backend method not yet implemented.",
  "frontend/src/hooks/useSubscription.ts": "React Query hooks for fetching subscription status and evaluating user entitlements based on subscription rules.",
  "frontend/src/hooks/useTestimonials.ts": "React Query hooks for fetching approved/pending testimonials, submitting new testimonials, and updating testimonial status with error sanitization.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile via actor methods.",
  "frontend/src/hooks/useWorkSessions.ts": "React Query hooks for work session management (log, end, add weather samples, fetch sessions); most backend methods are not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a black background with orange accent color scheme, including dark mode and alternative style variants (teal and warm sunset).",
  "frontend/src/lib/canisterConfig.ts": "Utility functions to extract canister ID from environment variables or IC domain URLs and generate webhook URLs for PagBank integration.",
  "frontend/src/lib/casesStorage.ts": "LocalStorage-based CRUD operations for case management including creating cases, updating status, attaching evidence, generating appeals, and managing timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region and neighborhood options for collective data filtering, mapping regions (Fortaleza, Caucaia, Maracanaú) to their respective neighborhoods.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages IndexedDB storage for evidence media (images, audio, video) and metadata, providing hooks and functions to store/retrieve evidence with auto-incrementing IDs.",
  "frontend/src/lib/lossCalculations.ts": "Calculates financial losses (weekly, monthly, accumulated, projected) based on daily earnings, work frequency, and deactivation date from a loss profile.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support contacts, mapping platforms to their support email addresses.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages checkout session state by storing and retrieving the selected subscription plan ID in sessionStorage.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing errors by type and indicating if admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages, handling configuration, authentication, and transaction failures.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user messages, categorizing error types and admin action requirements.",
  "frontend/src/lib/payments/pixPayload.ts": "Empty file, likely intended for PIX payment payload generation utilities.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/pagbank) in localStorage and determines active provider from public config with PagBank priority.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports as downloadable blobs, including platform info, deactivation date, and calculated financial losses.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan configurations (free 24h, pro monthly, pro annual) with pricing, features, and billing periods.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status, calculating expiry, trial/pro status, and days remaining, with date formatting utilities.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries and mailto links for support emails, including case details like platform, block date, reason, and evidence count.",
  "frontend/src/lib/templatesLibrary.ts": "Defines template data structures and provides a library of pre-written appeal templates, driver rights information, and evidence collection guides for various platforms and deactivation reasons.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages, handling auth, admin-only, and not-found error cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps responses to WeatherCondition enum values, with fallback defaults on error.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently only logs evidence IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for user management (block/unblock), payment configuration (gateway and PagBank settings), testimonial moderation, and setup guides.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating appeal letters using a wizard interface, evidence picker, and providing download/email options for the generated text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for selected subscription plans, supporting both gateway and PagBank providers with status tracking and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays aggregated anonymous community data about deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying module cards (Evidence Tracker, Loss Calculator, Resource Generator, Collective Data) and quick access buttons (Payments, Profile, Quick Consultation) with navigation links.",
  "frontend/src/pages/DataPolicyPage.tsx": "Data policy page explaining LGPD compliance, legal bases for data processing, categories of collected data (personal, work, financial, evidence), and data treatment purposes with a scrollable content area.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view page for a single evidence item, displaying metadata (type, platform, region, upload time) and rendering media content (image, audio, or video) based on evidence type.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Evidence tracker page with tabbed interface for managing evidence uploads and work sessions, wrapped in AuthGate for authenticated access.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Loss calculator page displaying a form to input loss profile data and showing calculated results, projection charts, and report generation actions when profile exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Payments information page showcasing available payment methods (PIX, credit card, bank slip) with trust badges and a call-to-action to view subscription plans.",
  "frontend/src/pages/PlansBillingPage.tsx": "Subscription plans page displaying available plans with pricing, features, current subscription status, and upgrade/checkout buttons with trust badges.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Displays subscription dashboard showing current plan status, expiry date, and comparison of available plans with upgrade functionality that navigates to checkout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a privacy policy page with scrollable content describing data collection, usage, storage, sharing practices, and user rights for the ROTAS E DIREITOS application.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to update their name and email, displaying their Internet Computer Principal ID with form validation and toast notifications.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing app features (evidence tracker, loss calculator, appeal generator, collective data) with style variants (A/B/C), marketing banner, testimonials, and trust badges.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality where users can search for administrative appeals and legal processes by number, currently showing development status alert.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, weather conditions, and associated evidence with navigation back to sessions list.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript types and enums (Region, EvidenceType, ReasonCategory) that mirror backend structures but aren't exported from the backend interface, including Evidence, Appeal, CollectiveReport, and PublicLossProfile interfaces.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus type, and CreateCaseParams for tracking user appeals and evidence through various workflow stages.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript file, likely a placeholder for future Mercado Pago payment integration types.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file, likely a placeholder for QR code library type definitions.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (with orange, black backgrounds, and white text), extended spacing, border radius variables, custom shadows, and typography/animation plugins.",
  "project_state.json": "Project metadata tracking completed features for implementing black background with orange/white color scheme and logo integration, with two pending feature requests for layout updates and logo placement."
}