{
  "backend/main.mo": "Main Motoko actor defining all data types (Evidence, Appeal, WorkSession, LossProfile, Testimonial, PaymentConfig, etc.) and integrating authorization mixins for access control and admin management.",
  "feature_evidence.json": "Feature evidence report documenting three PIX QR code payment features: generating fixed QR codes, implementing payload generation logic, and integrating QR display components in the checkout flow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, utilities, and components, noting many backend methods are stubbed/unimplemented and types are imported from backend-extended.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for backgrounds, foregrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with Portuguese language, PWA manifest, favicon references, theme color, and Google Fonts preconnect for Inter font family.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name 'ROTAS E DIREITOS', standalone display mode, theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router with routes for dashboard, evidence tracking, loss calculator, appeals, collective insights, plans, payments, profile, policies, and admin dashboard, plus ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials with approve/reject actions. Displays pending testimonials with parsed content (quote, name, role), timestamps, and status badges, with loading and empty states.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely a placeholder for MercadoPago payment integration setup guide component.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types (credit/debit card, PIX, boleto), installment options, and return/webhook URLs with validation.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Component that displays and manages PagBank webhook and return URLs. Shows auto-generated webhook URL with copy-to-clipboard functionality and allows editing of the return URL for post-payment redirection.",
  "frontend/src/components/AdminGate.tsx": "Authorization guard component that checks authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editor component for reviewing and modifying generated appeal text. Provides a textarea for editing, download as .txt functionality, and email sending option, with loading state while fetching appeal data.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and selected evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and platform labels.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that opens a mailto link for sending appeals via email, with an alert reminding users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component with responsive header, navigation sidebar, and mobile menu. Includes navigation items for dashboard, evidence, calculator, resources, collective data, profile, plans, and legal pages, with conditional rendering based on authentication and admin status.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt with alert UI when user is not authenticated, otherwise renders children. Provides a customizable message and login button.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A bar chart component that visualizes the distribution of collective reports across different platforms using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A pie chart component that displays the distribution of blocking reasons in collective reports with labeled percentages.",
  "frontend/src/components/collective/TrendChart.tsx": "A line chart component that shows the monthly trend of collective reports over time using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar that appears when evidence items are selected, showing count and providing export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with selection checkboxes, type/platform filters, and navigation to detail views. Loads evidence from IndexedDB and shows icons, badges, and metadata for each item.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for adding evidence via real-time capture or file upload. Handles form inputs for evidence type, platform, region, neighborhood, and notes, then saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture with tabs for photo, audio, and video recording. Uses custom hooks for camera and media recording, displays live preview, and handles capture/recording controls.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that manages Internet Identity authentication state. Handles login, logout with query cache clearing, and displays appropriate loading states and icons.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and updating loss profile data including daily earnings, work days per week, deactivation date, and platform. Loads existing profile data and submits updates via mutation hook.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts. Calculates loss projections at 10-day intervals based on the user's loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports. Generates text-based reports via PDF utility and handles native sharing or clipboard fallback.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated loss calculations. Uses calculation utilities to derive values from the loss profile.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "React component that displays an auto-rotating carousel banner showcasing platform features (evidence tracking, loss calculator, resource generator, etc.) with navigation controls and click-through to plans page.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and desktop/mobile image paths for platform features.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state with auto-advance timer, manual navigation (next/prev/goto), and pause/resume functionality for the marketing banner.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "React component providing step-by-step instructions for configuring PagBank payment integration, including account setup, API credentials, and webhook configuration with SSL/HTTPS notices.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays an alert when a payment provider is not configured, with role-based messaging and admin navigation button for administrators.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "React component that displays payment flow status (pending, completed, failed) with appropriate UI feedback, action buttons, and navigation options based on payment state.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "Component that generates and displays a PIX payment QR code with copy-to-clipboard functionality for both the QR code payload and PIX key (email).",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to set up their profile with name (required) and email (optional). Appears automatically when user profile is not found and cannot be dismissed until completed.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides UI controls to start/end work sessions with city selection, automatically fetches and logs weather samples every 30 minutes during active sessions using hooks and weather API.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with timestamps, city, weather sample counts, and active status badges; clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session ID state shared between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Conditionally renders children based on user entitlement status; shows upgrade prompt with lock icon if user lacks required subscription (basic or pro).",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Modal dialog for authenticated users to submit testimonials with quote, name, and role fields; includes validation, success/error states, and requires Internet Identity login.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Exports static testimonial data array with quotes from delivery workers about platform blocking and rights defense tools.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays a grid of approved testimonials from backend or fallback static data, with loading skeletons and a button to open the submit testimonial dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust indicator badges (Data Protected, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous backend actor based on Internet Identity state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admin operations including fetching all user access info and blocking/unblocking users (block/unblock functionality not yet implemented in backend).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Exports a mutation hook for updating payment configuration (admin only) with error sanitization to prevent exposing sensitive backend data.",
  "frontend/src/hooks/useAppeals.ts": "Provides React Query hooks for generating appeals and fetching appeal data; all backend methods are not yet implemented and throw errors.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages local storage-based progress tracking for blocked account help flow, including step navigation, completion status, and checklist items per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for CRUD operations on cases stored in local storage (casesStorage), including creating, updating, and attaching evidence/appeals to cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Provides hooks for submitting and retrieving collective reports; backend implementation is not available and returns empty arrays or throws errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps useInternetIdentity to provide simplified access to current user authentication state, principal ID, and logout functionality.",
  "frontend/src/hooks/useEvidence.ts": "Provides React Query hooks for evidence operations (upload, fetch, delete); backend methods are not implemented as evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state with mutations for creating payment sessions and checking payment status, including flow state tracking (idle, initiating, pending, completed, failed).",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) with localStorage persistence and toggle functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "React Query hook that checks if the current caller has admin privileges by calling the backend's isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides React Query hooks for fetching and setting user loss profiles, though the backend method for fetching is not yet implemented.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using the MediaRecorder API with controls for start, stop, pause, resume, and cancel operations.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file with no content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow state including session creation, payment status checking, and subscription invalidation on successful payment.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return and webhook URL configurations with query invalidation on updates.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to fetch and update PagBank transparent checkout configuration with query cache management.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration with caching and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch a reviso motivada message, though the backend method is not yet implemented.",
  "frontend/src/hooks/useSubscription.ts": "Fetches user subscription status and evaluates entitlements based on subscription rules.",
  "frontend/src/hooks/useTestimonials.ts": "Manages testimonial operations including fetching approved/pending testimonials, submitting new ones, and updating status with error sanitization.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile with query cache invalidation.",
  "frontend/src/hooks/useWorkSessions.ts": "Manages work session operations including logging sessions and fetching session data, though several backend methods are not yet implemented.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a black background theme with orange accents, including dark mode and alternative color variants (teal and warm sunset).",
  "frontend/src/lib/canisterConfig.ts": "Provides functions to retrieve the backend canister ID from environment variables, window location (IC domains), or fallback, and generates webhook URLs for PagBank integration.",
  "frontend/src/lib/casesStorage.ts": "Manages case data in localStorage with CRUD operations, including creating cases, attaching evidence and appeals, updating status, and maintaining timeline events.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides a function to retrieve neighborhoods for each region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages evidence media (images, audio, video) storage in IndexedDB with functions to store/retrieve media files and evidence metadata, plus React hooks for accessing stored media.",
  "frontend/src/lib/lossCalculations.ts": "Provides utility functions to calculate weekly, monthly, accumulated, and projected financial losses based on a worker's loss profile and deactivation date.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support emails with pre-filled subject and body content.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage during checkout flow with save, get, and clear operations.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing errors by type (user error, admin action required, etc.).",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages with categorization for user errors vs. admin configuration issues.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages with typed error categories and admin action flags.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation and TLV field formatting for Brazilian instant payment system.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway or PagBank) using localStorage for UI state persistence and determines active provider from public configuration with PagBank priority.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Generates QR code images using the qrserver.com public API, converting them to data URLs or providing direct image URLs for display.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports for drivers showing weekly, monthly, and accumulated earnings losses based on deactivation profiles.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines three subscription plan tiers (free 24h, pro monthly, pro annual) with pricing, features, and billing periods for the application.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status including trial/pro status, expiration, and remaining days, plus formats expiry dates for display.",
  "frontend/src/lib/supportSummary.ts": "Generates case summaries and pre-filled support email links with case details including platform, block date, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of pre-written templates for appeals, driver rights information, evidence collection guidelines, and communication with platforms like iFood and Uber.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages covering authentication, authorization, not found, and generic failure cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps conditions to application-specific weather enums with fallback defaults.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently logs evidence IDs but does not implement actual ZIP creation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for user management (block/unblock), payment provider configuration (Gateway/PagBank), testimonial moderation, and PagBank transparent checkout setup with save functionality.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters with wizard-based input, evidence picker, and options to download or email the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans, supporting both Gateway and PagBank providers with PIX QR code display and payment status tracking.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated data from delivery workers including platform distribution, reason categories, and trends with filtering by platform, region, and reason.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with navigation cards to key modules (evidence tracker, loss calculator, appeal generator, collective data) and quick access shortcuts.",
  "frontend/src/pages/DataPolicyPage.tsx": "Static page displaying the data policy and LGPD compliance information, including data categories, legal bases, processing purposes, and user rights.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view for a single evidence item, displaying metadata, badges, and rendering media content (images, audio, video) from IndexedDB.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Main page for evidence tracking with tabs for evidence uploads/timeline and work sessions. Wraps content in AuthGate requiring authentication.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Page for calculating financial losses from deactivation, displaying a form, results cards, projection chart, and report actions. Shows placeholder when no profile exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Informational page displaying available payment methods (PIX, credit card, bank slip) with trust badges and a CTA to view plans. No actual payment processing.",
  "frontend/src/pages/PlansBillingPage.tsx": "Subscription plans page showing current user entitlement status and all available plans with features, pricing, and upgrade buttons. Includes trust badges and highlights recommended plan.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Dashboard for managing subscriptions, displaying current plan status with expiry info and a comparison grid of all available plans with upgrade functionality.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page with scrollable content covering data collection, usage, storage, security, sharing, user rights, and contact information.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page with form for updating name and email, plus display of Internet Computer Principal ID. Includes loading and error states.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page displaying features, testimonials, trust badges, and marketing banners with A/B/C style variants for homepage testing.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality where users can search and track administrative appeals and legal processes by number.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, weather conditions, and delivery statistics.",
  "frontend/src/types/backend-extended.ts": "Extends backend types with frontend-specific enums and interfaces for Evidence, Appeals, CollectiveReports, and related data structures.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, and CaseStatus types.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript declaration file for MercadoPago payment integration types.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file for QR code library type definitions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both hash-based and browser-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH color space, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, existing features, and new feature requests including PIX QR code payment integration."
}