{
  "backend/main.mo": "Defines backend actor with types and state for evidence, sessions, appeals, loss profiles, subscriptions, user access, and profile queries with authorization checks.",
  "feature_evidence.json": "Lists evidence‑related frontend features, associated files, components, and test IDs for build planning.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including hooks, components, utilities, and pages.",
  "frontend/index.css": "Sets Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point defining root container, metadata, icons, and script loader.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, and icon assets.",
  "frontend/src/App.tsx": "Configures TanStack router and main route structure, including auth‑based root and all page routes.",
  "frontend/src/components/AdminGate.tsx": "UI gate that checks authentication and admin status before allowing access to protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editor para revisar e alterar texto de recurso gerado, com opção de download e envio por e-mail.",
  "frontend/src/components/appeal/AppealWizard.tsx": "Wizard de quatro etapas para gerar um recurso, incluindo plataforma, motivo, explicação e evidências.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "Lista evidências cadastradas permitindo seleção múltipla, com carregamento e mensagens de vazio.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "Gera e abre link mailto com o recurso e exibe aviso sobre anexos manuais necessários.",
  "frontend/src/components/AppLayout.tsx": "Layout principal com navegação lateral responsiva, itens condicionais por autenticação e acesso rápido, incluindo suporte a admins.",
  "frontend/src/components/AuthGate.tsx": "Protege rotas exibindo alerta e botão de login quando o usuário não está autenticado.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "UI component providing dropdown filters for platform, reason, region, and time period.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "Dialog prompting users to share anonymous report data, collecting region and neighborhood before submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "Displays a bar chart of report counts by platform with optional filters and time window.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "Shows a vertical bar chart summarizing report counts by reason with applied filters.",
  "frontend/src/components/collective/TrendChart.tsx": "Renders a daily line chart of report trends over a selected period with filtering.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "Provides dropdown filters for narrowing evidence items by type and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "Toolbar for selecting evidence items and exporting selected files as a ZIP.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable evidence timeline with selectable cards and image previews. Fetches evidence data, handles selection, and navigates to evidence details.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Form for uploading new evidence with type, platform, region, and notes, then storing the image in IndexedDB. Uses a mutation to create evidence entries.",
  "frontend/src/components/LoginButton.tsx": "Botão de login/logout que gerencia estado de autenticação e trata erros comuns de sessão.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form to view and edit loss profile settings including earnings, workdays, platform, and deactivation date. Saves the updated profile via mutation.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a bar chart showing 30, 60, and 90‑day loss projections based on the user’s loss profile. Uses Recharts for visualization.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides buttons to download or share a text-based loss report generated from the user's profile. Handles browser share API fallback logic.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Shows summary cards for weekly, monthly, accumulated, and 90‑day projected losses. Formats values as BRL currency.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "Marketing banner highlighting supported platforms and app benefits. Includes responsive imagery, badges, and benefit cards.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal exibido para novos usuários coletarem nome e email e salvar o perfil inicial.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "UI for starting and ending work sessions, selecting city, and periodically logging weather data.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of past work sessions with timestamps, weather sample count, and navigation on click.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Wraps session controls and session history list, managing the active session state.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Gates content based on subscription status and shows upgrade prompts when access is blocked.",
  "frontend/src/components/trust/TrustBadges.tsx": "Shows a set of trust and security badges for UI reassurance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for admin actions such as listing users and blocking or unblocking them.",
  "frontend/src/hooks/useAppeals.ts": "Hooks for generating appeals and fetching individual or user-specific appeal records.",
  "frontend/src/hooks/useCollectiveReports.ts": "Hooks for submitting and retrieving collective reports from the backend.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current user identity info and logout capability from Internet Identity.",
  "frontend/src/hooks/useEvidence.ts": "Hooks for creating evidence, fetching evidence by ID, listing all evidence, and retrieving timeline data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, loading stored identities, and tracking login status.",
  "frontend/src/hooks/useIsAdmin.ts": "Fetches whether the current caller is an admin using the actor and react-query.",
  "frontend/src/hooks/useLossProfile.ts": "Queries and mutates the caller's loss profile via the actor, with invalidation on updates.",
  "frontend/src/hooks/useQueries.ts": "Retrieves the 'reviso motivada' message from the backend using react-query.",
  "frontend/src/hooks/useSubscription.ts": "Handles subscription status fetching, entitlement evaluation, and plan upgrades with react-query.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and saves the caller's user profile, exposing loading states and invalidating queries on save.",
  "frontend/src/hooks/useWorkSessions.ts": "Creates, updates, and fetches work sessions and weather samples, with related query invalidations.",
  "frontend/src/index.css": "Tailwind setup defining color variables, dark mode overrides, and base styling.",
  "frontend/src/lib/collectiveOptions.ts": "Maps regions to neighborhood lists and provides a lookup function.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages storing and retrieving evidence images in IndexedDB and exposes a hook to load them as object URLs.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses based on a loss profile.",
  "frontend/src/lib/mailto.ts": "Builds mailto links for different platforms with predefined subjects and body text.",
  "frontend/src/lib/payments/checkoutState.ts": "Stores, retrieves, and clears the selected subscription plan in sessionStorage.",
  "frontend/src/lib/pdfReport.ts": "Generates a text-based financial loss report as a Blob or downloadable file.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan metadata and provides a lookup by plan ID.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status and formats expiry dates.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap and maps conditions to internal enums with fallback handling.",
  "frontend/src/lib/zipExport.ts": "Generates and downloads a manifest JSON and associated evidence images using IndexedDB data.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for viewing users, filtering them, and blocking or unblocking accounts with confirmation dialogs.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Form for selecting platform, reason, evidence, and text to generate an appeal using backend hooks.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays plan checkout flow, payment methods, and triggers subscription upgrade processing.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Shows collective statistics with filters and charts based on anonymized deactivation data.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard with quick-access shortcuts and modules for evidence, calculator, appeals, and collective data.",
  "frontend/src/pages/DataPolicyPage.tsx": "Renders a scrollable data policy page detailing principles, legal bases, data categories, and purposes of data processing.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Displays detailed information for a specific evidence item, including image, upload date, platform, and notes.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Provides tabs for uploading evidence and managing work sessions behind an authentication gate.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Shows a loss calculation form and, if available, results, charts, and report actions for financial loss estimates.",
  "frontend/src/pages/PaymentsPage.tsx": "Lists payment methods and directs users to plan selection, with trust badges and important payment notes.",
  "frontend/src/pages/PlansBillingPage.tsx": "Displays available subscription plans, highlights the popular option, and allows selecting a plan for checkout.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Shows the user's current subscription status and expiration, and provides a comparison of all available plans.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the app's privacy policy with scrollable sections detailing data collection, usage, security, and sharing. Uses cards and headings to display static informational content.",
  "frontend/src/pages/ProfilePage.tsx": "Provides a user profile form that loads, edits, and saves name and email through hooks. Displays Internet Identity info and handles validation and toast feedback.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Shows the public marketing overview with key feature cards, CTA buttons, a banner, and security highlights. Aimed at presenting product capabilities to non-logged users.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Displays a form to search processes by number and shows an alert indicating the feature is under development. Includes a future-features section listing planned capabilities.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Loads and displays detailed information about a work session, including timestamps, city, weather, and duration. Handles loading, not-found states, and navigation back.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, and clearing URL and session parameters. Supports both query-string and hash-based routing with persistence in sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project state file describing app vision, architecture, payment requirements, features, and image needs for the ROTAS E DIREITOS app."
}