{
  "backend/main.mo": "Main backend actor defining all data types (Evidence, Appeal, WorkSession, UserProfile, Testimonial, Payment configs, etc.) and implementing user access control, subscription management, testimonials, payment configuration, and admin functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating the color palette in index.css to match logo colors, and updating theme colors in index.html and manifest.webmanifest for consistency.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and utilities, noting that many backend methods are stubbed and types are imported from backend-extended.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system using warm orange primary (0.75 0.15 55) and deep navy blue secondary (0.30 0.08 240) extracted from the logo, with full light and dark mode support.",
  "frontend/index.html": "HTML entry point with meta tags, favicon links, manifest reference, and theme-color set to #E89A3C (logo orange) for browser UI integration.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode, and theme colors (#E89A3C orange, #3D4F6B navy) for progressive web app functionality.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router with routes for home, dashboard, evidence tracking, loss calculator, appeals, collective insights, plans, payments, profile, policies, and admin, plus ProfileSetupModal for authenticated users.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials with approve/reject actions. Displays pending testimonials with formatted timestamps, status badges, and handles status updates with toast notifications.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely placeholder for MercadoPago payment integration setup guide component.",
  "frontend/src/components/admin/PagBankTransparentCheckoutForm.tsx": "Admin form for configuring PagBank transparent checkout settings including token, email, public key, accepted payment types, installments, and return/webhook URLs. Includes validation and save functionality.",
  "frontend/src/components/admin/PagBankWebhookUrlDisplay.tsx": "Component displaying auto-generated webhook URL for PagBank integration with copy-to-clipboard functionality. Allows configuration of return URL for post-payment redirection.",
  "frontend/src/components/AdminGate.tsx": "Access control component that verifies authentication and admin status, displaying appropriate loading states or access denied messages before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Text editor for reviewing and editing generated appeal documents. Provides textarea for editing, download as .txt functionality, and email sending integration via SendViaEmailButton.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and selected evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A card component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that generates a mailto link for sending appeals via email, with an alert warning users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component with responsive header, navigation sidebar, and mobile menu. Includes navigation items for authenticated users, admin-specific links, and integrates LoginButton and profile setup modal.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt with alert UI when user is not authenticated, otherwise renders children. Provides customizable message prop.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form card for submitting anonymous collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A card component displaying a bar chart of collective report counts grouped by platform using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A card component displaying a pie chart showing the distribution of collective reports by reason category using Recharts.",
  "frontend/src/components/collective/TrendChart.tsx": "A card component displaying a line chart showing the trend of collective reports over time, grouped by month using Recharts.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar that appears when evidence items are selected, showing selection count with export and clear buttons.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with selection checkboxes, type/platform filters, and navigation to detail views. Loads evidence from IndexedDB and shows icons, metadata, and selection toolbar.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for adding evidence via real-time capture or file upload. Handles form inputs for evidence type, platform, region, neighborhood, and notes, then saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture with tabs for photo, audio, and video recording. Uses custom hooks for camera and media recording, displays preview streams, and handles capture/recording controls.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component using Internet Identity authentication. Handles login state, displays appropriate icons and text, and clears query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and updating loss profile data including daily earnings, days per week, deactivation date, and platform. Loads existing profile data and submits updates via mutation hook.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts. Calculates data points at 10-day intervals based on the provided loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports. Generates text reports from profile data and handles native share API or clipboard fallback.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated loss calculations. Uses calculation utilities to derive values from the loss profile.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "React component that displays a clickable carousel banner showcasing platform features (evidence tracking, loss calculator, resource generator, etc.) with navigation controls and auto-advance functionality.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and image paths for desktop and mobile views.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state and behavior including auto-advance timer, slide navigation, and pause/resume functionality.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "React component that provides step-by-step instructions for configuring PagBank payment integration, including account setup, API credentials, and webhook configuration with SSL/HTTPS notices.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays appropriate messaging and actions when a payment provider is not configured, with different UI for admin vs regular users.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "React component that displays payment status (pending, completed, or failed) with appropriate icons, messages, and action buttons for different payment flow states.",
  "frontend/src/components/payments/PixQrCodeDisplay.tsx": "Component that generates and displays a PIX QR code for payment, with copy-to-clipboard functionality for both the PIX key and payload, plus error handling and retry logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name (required), email, platform, region, and phone. Shows only when user profile is null after authentication.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Provides UI controls to start/end work sessions with city selection, and automatically fetches and logs weather samples every 30 minutes during an active session.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of all work sessions with their city, timestamps, weather sample counts, and active status; clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session ID state shared between them.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Conditionally renders children based on user entitlement status, showing a locked state with upgrade prompts if the user lacks required subscription access.",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog form for authenticated users to submit testimonials with quote, name, and role fields, including validation, error handling, and success confirmation.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Exports static testimonial data as fallback content, containing quotes from delivery workers about the platform.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials from the backend (or fallback static data), with loading skeletons and a button to open the submission dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust indicator badges (Data Protected, Secure Payment, 100% Trustworthy) with icons in a horizontal layout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admin operations including fetching all user access info and blocking/unblocking users (block/unblock functionality not yet implemented in backend).",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Exports a mutation hook for updating payment configuration (admin only) with error sanitization to avoid exposing sensitive backend data.",
  "frontend/src/hooks/useAppeals.ts": "Provides React Query hooks for generating appeals and fetching appeal data; all backend methods are not yet implemented and throw errors.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages local storage-based progress tracking for blocked account help flow, including step navigation, completion status, and checklist items per user principal.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for CRUD operations on cases stored in local storage (casesStorage), including creating, updating, and attaching evidence/appeals to cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Provides hooks for submitting and retrieving collective reports; backend implementation is not available and returns empty arrays or throws errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps useInternetIdentity to provide simplified access to current user authentication state, principal ID, and logout functionality.",
  "frontend/src/hooks/useEvidence.ts": "Provides React Query hooks for evidence operations (upload, fetch, delete); backend methods are not implemented as evidence is stored client-side in IndexedDB.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state with mutations for creating payment sessions and checking payment status, including state tracking (idle, initiating, pending, completed, failed).",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) with localStorage persistence and toggle functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useIsAdmin.ts": "React Query hook that checks if the current caller has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides React Query hooks for fetching and setting user loss profiles, though the backend method is not yet implemented.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using the MediaRecorder API with start, stop, pause, resume, and cancel controls plus duration tracking.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "Empty file with no content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Manages PagBank payment flow state including session creation, status checking, and redirects to checkout URL with mutation hooks.",
  "frontend/src/hooks/usePagBankReturnWebhookUrls.ts": "Provides hooks to get and set PagBank return and webhook URL configuration using React Query.",
  "frontend/src/hooks/usePagBankTransparentCheckout.ts": "Provides hooks to fetch and update PagBank transparent checkout configuration via React Query.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "Fetches public (non-sensitive) payment provider configuration with caching and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch a 'reviso motivada' message, though the backend method is not yet implemented.",
  "frontend/src/hooks/useSubscription.ts": "Fetches user subscription status and evaluates entitlements using business rules from the subscriptions library.",
  "frontend/src/hooks/useTestimonials.ts": "Manages testimonial CRUD operations including fetching approved/pending testimonials, submitting new ones, and updating status with admin controls.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile using React Query with cache invalidation.",
  "frontend/src/hooks/useWorkSessions.ts": "Defines hooks for logging work sessions and managing weather samples, though most backend methods are not yet implemented.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with brand-aligned color palette (orange/gold and navy blue) including light/dark modes and style variants.",
  "frontend/src/lib/canisterConfig.ts": "Provides functions to retrieve the backend canister ID from environment variables, window location (IC domains), or fallback to local development ID, and generates webhook URLs.",
  "frontend/src/lib/casesStorage.ts": "Manages case data in localStorage with functions to create, read, update cases, attach evidence/appeals, and maintain timeline events for each user principal.",
  "frontend/src/lib/collectiveOptions.ts": "Defines region options (Fortaleza, Caucaia, Maracanaú) and provides neighborhood lists mapped to each region for collective action forms.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages evidence media (images, audio, video) and metadata storage in IndexedDB with hooks for retrieving media URLs and functions for saving/loading evidence records.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses for delivery workers based on their earnings profile and deactivation date.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support contacts with pre-filled subject and body parameters.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages selected subscription plan state in sessionStorage during checkout flow with save, get, and clear functions.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing errors by type and indicating whether admin action is required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages, handling configuration, authentication, and payment processing errors.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages with categorized error types and admin action flags.",
  "frontend/src/lib/payments/pixPayload.ts": "Generates valid PIX EMV QR code payloads following BR Code specification, including CRC16 checksum calculation and TLV formatting for Brazilian instant payment system.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/PagBank) in localStorage and determines active provider from public config with PagBank prioritized over gateway.",
  "frontend/src/lib/payments/qrCodeGenerator.ts": "Dynamically loads qrcode library from CDN and generates QR code data URLs client-side without npm dependencies.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports for deactivated drivers showing weekly, monthly, and accumulated earnings losses based on their profile.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan tiers (free 24h, pro monthly, pro annual) with pricing, features, and billing periods for the platform.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status including trial/pro status, expiration, and remaining days, plus formats expiry dates for display.",
  "frontend/src/lib/supportSummary.ts": "Generates case summaries and creates pre-filled support email links with case details including platform, block date, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Provides a library of pre-written templates for appeals, driver rights documentation, evidence guidelines, and communication with platforms like iFood and Uber.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages, handling auth, admin-only, and not-found error cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps conditions to internal WeatherCondition enum with fallback defaults.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as ZIP archive; currently only logs evidence IDs for future implementation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing users (block/unblock), payment provider configuration (Gateway/PagBank), testimonials moderation, and viewing user access information with tabs for different admin functions.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating professional appeal letters using a wizard interface, evidence picker, and AI generation; supports downloading appeals as text files or sending via email.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for subscription plans, supporting both Gateway and PagBank providers with PIX QR code display, payment status tracking, and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays anonymous aggregated community data about delivery worker deactivations with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard landing page with navigation cards to key modules (evidence tracker, loss calculator, appeal generator, collective data) and quick access shortcuts to payments, profile, and quick search.",
  "frontend/src/pages/DataPolicyPage.tsx": "Static page displaying the data privacy policy with sections on LGPD compliance, legal basis for data processing, data categories collected, and treatment purposes in a scrollable card layout.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Displays detailed view of a single evidence item with media preview (image, audio, or video), metadata badges, and navigation back to evidence list.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Main evidence tracking page with tabs for evidence uploads/timeline and work sessions, wrapped in authentication gate.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing four main features (evidence tracker, loss calculator, resource generator, collective data) with hero section and benefits display.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Page for calculating financial losses from deactivation, displaying profile form, results cards, projection chart, and report actions when profile exists.",
  "frontend/src/pages/PaymentsPage.tsx": "Informational page displaying available payment methods (PIX, credit card, bank slip) with trust badges and navigation to plans page.",
  "frontend/src/pages/PlansBillingPage.tsx": "Subscription plans comparison page showing current user entitlement status and all available plans with upgrade/subscribe buttons.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Subscription management dashboard displaying current subscription details, expiry information, and side-by-side plan comparison with upgrade options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays a privacy policy page with sections on data collection, usage, storage, security, and sharing. Uses Card and ScrollArea components to present the policy content in Portuguese.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to view and edit personal information including name, email, platform, region, and phone. Uses form inputs and hooks to fetch and save profile data.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing app features (evidence tracker, loss calculator, appeal generator, collective data) with marketing banners, testimonials, and style variant toggle. Includes navigation to plans and privacy pages.",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality where users can search for administrative appeals and legal processes by number. Currently shows a development notice and planned features.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, and weather conditions. Fetches session data by ID from route params.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript types and enums (Region, EvidenceType, Evidence, ReasonCategory, Appeal, CollectiveReport, PublicLossProfile) that complement or are missing from the backend interface definitions.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus, and CreateCaseParams for tracking deactivation cases and their lifecycle.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript module file, likely intended for MercadoPago payment integration type definitions.",
  "frontend/src/types/qrcode.d.ts": "TypeScript declaration file for the QRCode library loaded via CDN, defining global Window interface extensions for QR code generation methods (toDataURL, toCanvas, toString).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, extended theme settings, container configurations, and custom font families.",
  "project_state.json": "Project state file tracking existing features for updating the application's color palette to match logo colors, including theme color updates across HTML and manifest files."
}