{
  "backend/main.mo": "Defines Motoko actor storing evidence, work sessions, loss profiles, appeals, and user profiles with access control and CRUD-style shared/query methods.",
  "feature_evidence.json": "Feature metadata describing app modules, files involved, components used, and associated requirements for multiple features.",
  "frontend-file-summaries.txt": "A mapping of frontend file paths to short functional summaries for hooks, utilities, components, and styling.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light/dark themes and applying base layout rules.",
  "frontend/index.html": "HTML entry point setting language, meta tags, root div, and loading the main React script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router root, routes for all app pages, and wraps content in AppLayout with optional profile modal.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Loads a generated appeal, lets the user edit its text, download it as .txt, or send via email.",
  "frontend/src/components/appeal/AppealWizard.tsx": "Four‑step flow to collect platform, reason, explanation, and evidence, then generate an appeal and show the editor.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "Lists user evidence with filters and checkboxes, allowing selection for inclusion in an appeal.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "Builds a mailto link to send the appeal text and shows a reminder that attachments must be added manually.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, navigation menu, footer, and responsive mobile drawer around routed content.",
  "frontend/src/components/AuthGate.tsx": "Guard component that blocks access for unauthenticated users and shows a login prompt message.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "UI controls for filtering collective reports by platform, reason, region, and time period.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "Dialog prompting users to anonymously share deactivation info for collective reports, with region and neighborhood selection.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "Renders a bar chart showing report counts per platform after applying time and metadata filters. Uses collective reports to compute platform totals and display them with Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "Displays a vertical bar chart of report counts grouped by reason category. Filters reports by platform, reason, region, and time before generating sorted counts.",
  "frontend/src/components/collective/TrendChart.tsx": "Generates a line chart of daily report counts over a given period. Builds a date-indexed dataset from filtered reports to show trends over time.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "Provides dropdown filters for evidence type and platform. Updates parent state when selection changes.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "Toolbar for selecting all, clearing selection, and exporting selected evidence as a ZIP. Shows the count of selected items and triggers export logic.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable, selectable list of evidence cards with image previews, metadata, and navigation to detail pages. Supports bulk selection and integrates with timeline fetch and IndexedDB image retrieval.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Form for uploading new evidence with metadata such as type, platform, region, and notes. Reads file data, sends it to the backend, and stores the image locally in IndexedDB on success.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and React Query cache clearing.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form for viewing and updating the user's loss profile, including earnings, deactivation date, and platform, with save handling.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Displays 30/60/90‑day loss projections as a bar chart using calculated loss data.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides buttons to generate, download, or share a text-based financial loss report.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Shows calculated weekly, monthly, accumulated, and 90‑day projected losses in summary cards.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that prompts new users to enter name and optional email, saving the profile before continuing.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "Controls for starting and ending work sessions and periodically recording weather data.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Lists past and active work sessions with timestamps, locations, and weather sample counts.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Combines session controls and session history into a full work session management section.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useAppeals.ts": "Hooks for generating appeals and fetching individual or caller appeals from the backend.",
  "frontend/src/hooks/useCollectiveReports.ts": "Hooks for submitting and retrieving collective reports via the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns authentication status, principal info, and logout method from Internet Identity.",
  "frontend/src/hooks/useEvidence.ts": "React Query hooks for creating and fetching evidence and timeline data using the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useLossProfile.ts": "Hooks to fetch and update the caller’s loss profile via the actor API.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch a single message field from the backend via the actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for loading and saving the caller’s user profile with proper query invalidation.",
  "frontend/src/hooks/useWorkSessions.ts": "Hooks to manage work sessions including logging, ending, adding weather samples, and fetching sessions.",
  "frontend/src/index.css": "Tailwind setup defining global CSS variables, themes, and base styles including dark mode overrides.",
  "frontend/src/lib/collectiveOptions.ts": "Maps regions to neighborhood lists and exposes a helper to retrieve neighborhoods by region.",
  "frontend/src/lib/evidenceIndexedDb.ts": "IndexedDB utilities and a hook for storing and retrieving evidence images as blobs.",
  "frontend/src/lib/lossCalculations.ts": "Functions to compute weekly, monthly, accumulated, and projected financial losses from a loss profile.",
  "frontend/src/lib/mailto.ts": "Builds mailto links for platform-specific appeal emails with preset subjects.",
  "frontend/src/lib/pdfReport.ts": "Generates a text-based loss report as a downloadable file or blob using calculated losses.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap and maps it to internal weather conditions.",
  "frontend/src/lib/zipExport.ts": "Exports evidence metadata and images by downloading a manifest and each image individually.",
  "frontend/src/main.tsx": "Initializes React, QueryClient, and InternetIdentityProvider before rendering the app.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page component showing the appeal generator UI wrapped in an authentication gate.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Renders collective data insights with filters and charts for platform, reason, region, and time period. Manages filter state and displays distributions and trend charts.",
  "frontend/src/pages/Dashboard.tsx": "Provides the main dashboard with navigation cards linking to app modules. Includes a privacy notice card for users.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Displays detailed information for a specific evidence item, including image, upload date, platform, and notes. Handles loading and not-found states.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Shows evidence tracker with tabs for evidence uploads and work session logs. Requires authentication and renders forms and timelines.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Hosts the loss calculator with profile form, results, projections, and report generation. Uses authentication and conditionally displays results based on saved profile data.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page describing app modules and prompting login via Internet Identity. Includes data privacy information and feature overview.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays details of a work session including times, duration, city, and weather, with loading and not-found handling. Provides navigation back to sessions list.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration adding custom colors, layout settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing the project’s architecture, features, requirements, and image assets for the ROTAS E DIREITOS app."
}