{
  "backend/main.mo": "Main actor defining all data types (Evidence, Appeal, WorkSession, LossProfile, Testimonial, PaymentConfig with PagBank support, etc.) and implementing business logic for user profiles, subscriptions, collective reports, payment processing, testimonials, and admin functions with authorization mixins.",
  "backend/migration.mo": "Migration module defining old and new actor types to handle schema evolution, specifically migrating from OldPaymentConfig (without PagBank) to NewPaymentConfig (with PagBankConfig fields for clientId, clientSecret, merchantId, webhookSecret).",
  "feature_evidence.json": "Feature evidence report documenting four PagBank integration features: admin config panel, frontend payment flow hook, CheckoutPage provider detection, and PagBankSetupGuide component with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including hooks (useUserProfile, useEvidence, useAppeals, etc.), utilities (IndexedDB, weather client, PDF generation), components (evidence timeline, work sessions, loss reports), and styling with OKLCH color system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme colors using OKLCH color space, including primary, secondary, accent, destructive, sidebar, and chart colors with proper contrast ratios.",
  "frontend/index.html": "HTML entry point with Portuguese locale, PWA manifest, theme color, favicon links, and preconnected Google Fonts loading Inter font family.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name 'ROTAS E DIREITOS', standalone display mode, theme colors, and icon assets at 192x192 and 512x512 resolutions for maskable purposes.",
  "frontend/src/App.tsx": "Main application router setup using TanStack Router, defining all routes (dashboard, evidence, calculator, appeals, payments, profile, admin, etc.) and rendering the root layout with authentication-aware index component.",
  "frontend/src/components/admin/AdminTestimonialsModerationPanel.tsx": "Admin panel for moderating user testimonials, allowing admins to approve or reject pending testimonials with status badges and formatted timestamps.",
  "frontend/src/components/admin/MercadoPagoSetupGuide.tsx": "Empty file, likely intended for MercadoPago payment integration setup instructions or configuration UI.",
  "frontend/src/components/AdminGate.tsx": "Authorization guard component that checks if user is authenticated and has admin privileges, displaying appropriate error states or loading indicators before rendering protected admin content.",
  "frontend/src/components/appeal/AppealEditor.tsx": "Editable text area for reviewing and modifying generated appeal text with download and email sending functionality for specific platform appeals.",
  "frontend/src/components/appeal/AppealWizard.tsx": "A form component for generating appeals that collects platform, reason category, user explanation, and selected evidence IDs, with validation and loading states.",
  "frontend/src/components/appeal/EvidencePicker.tsx": "A component that displays a list of evidence items from IndexedDB with checkboxes for multi-selection, showing type badges and notes for each item.",
  "frontend/src/components/appeal/SendViaEmailButton.tsx": "A button component that opens a mailto link for sending appeals via email, with an alert reminding users to manually attach evidence files.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with responsive header, navigation menu (sheet on mobile), and conditional navigation items based on authentication and admin status.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that displays a login prompt with customizable message when user is not authenticated, otherwise renders children.",
  "frontend/src/components/collective/CollectiveFilters.tsx": "A filter component with three dropdowns for filtering collective reports by platform, region, and reason category.",
  "frontend/src/components/collective/CollectiveSharePrompt.tsx": "A form component for anonymously submitting collective reports with platform, region, neighborhood, and reason fields, showing success state after submission.",
  "frontend/src/components/collective/PlatformDistribution.tsx": "A bar chart component that visualizes the distribution of collective reports across different platforms using Recharts.",
  "frontend/src/components/collective/ReasonDistribution.tsx": "A pie chart component that displays the distribution of blocking reasons in collective reports with labeled percentages.",
  "frontend/src/components/collective/TrendChart.tsx": "A line chart component that shows the trend of collective reports over time, grouped by month.",
  "frontend/src/components/evidence/EvidenceFilters.tsx": "A filter component with two dropdowns for filtering evidence by type (selfie, screenshot, audio, video) and platform.",
  "frontend/src/components/evidence/EvidenceSelectionToolbar.tsx": "A toolbar that appears when evidence items are selected, showing count and providing export and clear selection actions.",
  "frontend/src/components/evidence/EvidenceTimeline.tsx": "Displays a filterable timeline of evidence items with selection checkboxes, type/platform filters, and navigation to detail views. Loads evidence from IndexedDB and shows icons, timestamps, and metadata for each item.",
  "frontend/src/components/evidence/EvidenceUploadForm.tsx": "Provides a tabbed interface for adding evidence via real-time capture or file upload. Handles form inputs for evidence type, platform, region, and notes, then saves to IndexedDB.",
  "frontend/src/components/evidence/RealTimeCapturePanel.tsx": "Implements real-time media capture with tabs for photo, audio, and video recording. Uses custom hooks for camera and media recording with preview, duration display, and error handling.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication, manages loading states, and clears query cache on logout.",
  "frontend/src/components/loss/LossProfileForm.tsx": "Form component for entering and saving loss profile data including daily earnings, work days per week, deactivation date, and platform. Loads existing profile data and validates inputs before submission.",
  "frontend/src/components/loss/LossProjectionChart.tsx": "Renders a line chart showing projected earnings loss over 90 days using Recharts. Calculates loss projections at 10-day intervals based on the user's loss profile.",
  "frontend/src/components/loss/LossReportActions.tsx": "Provides download and share buttons for loss reports. Generates text reports from loss profile data and handles native sharing or clipboard fallback.",
  "frontend/src/components/loss/LossResultsCards.tsx": "Displays three metric cards showing weekly, monthly, and accumulated loss calculations. Uses calculation utilities to derive values from the loss profile.",
  "frontend/src/components/marketing/MarketingBanner.tsx": "React component that displays a clickable carousel banner showcasing platform features (evidence tracking, loss calculator, etc.) with navigation controls, auto-advance, and variant styling options.",
  "frontend/src/components/marketing/marketingBannerSlides.ts": "Defines the data structure and content for five marketing banner slides, each with headline, subheadline, and desktop/mobile image paths for platform features.",
  "frontend/src/components/marketing/useMarketingBannerCarousel.ts": "Custom React hook that manages carousel state with auto-advance timer, manual navigation (next/prev/goto), and pause/resume functionality for the marketing banner.",
  "frontend/src/components/payments/MercadoPagoNextSteps.tsx": "Empty file with no content.",
  "frontend/src/components/payments/PagBankSetupGuide.tsx": "React component that renders a step-by-step guide for integrating PagBank payment provider, including account creation, API credentials, webhook setup, and security warnings.",
  "frontend/src/components/payments/PaymentProviderNotConfigured.tsx": "Reusable component that displays an alert when a payment provider is not configured, with role-based messaging and admin navigation button for setup.",
  "frontend/src/components/payments/PaymentStatusPanel.tsx": "React component that displays payment flow status (pending, completed, failed) with appropriate UI feedback, retry options, and navigation actions based on payment state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for new users to collect basic profile information (name and optional email) before allowing access to the application.",
  "frontend/src/components/sessions/WorkSessionControls.tsx": "React component for starting/ending work sessions with city selection, automatic weather sampling every 30 minutes, and session state management with loading indicators.",
  "frontend/src/components/sessions/WorkSessionsList.tsx": "Displays a list of work sessions with loading/empty states, showing session details (city, timestamps, weather samples) and highlighting active sessions. Clicking a session navigates to its detail page.",
  "frontend/src/components/sessions/WorkSessionsSection.tsx": "Container component that combines WorkSessionControls and WorkSessionsList, managing the active session ID state and providing the main UI for work session management.",
  "frontend/src/components/subscription/FeatureGate.tsx": "Access control component that checks user entitlement and displays a locked/expired subscription message with upgrade prompts if the user lacks required access (basic or pro).",
  "frontend/src/components/testimonials/SubmitTestimonialDialog.tsx": "Dialog form for authenticated users to submit testimonials with validation (quote, name, role fields), success/error handling, and character limits. Requires Internet Identity authentication.",
  "frontend/src/components/testimonials/testimonialsData.ts": "Static data file containing six hardcoded testimonials from delivery workers, used as fallback content when no backend testimonials are available.",
  "frontend/src/components/testimonials/TestimonialsSection.tsx": "Displays approved testimonials in a grid layout with loading skeletons, falling back to static testimonial data if no backend testimonials exist. Includes a button to open the submission dialog.",
  "frontend/src/components/trust/TrustBadges.tsx": "Displays three trust indicator badges (Data Protection, Secure Payment, 100% Trustworthy) with icons in a horizontal flex layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin hooks for fetching all user access info and blocking/unblocking users, though block/unblock mutations throw not-implemented errors.",
  "frontend/src/hooks/useAdminPaymentConfig.ts": "Provides mutation hook for updating payment configuration (admin only) with error sanitization and validation, invalidating public config cache on success.",
  "frontend/src/hooks/useAppeals.ts": "Defines hooks for generating appeals and fetching appeal data, but all backend methods throw not-implemented errors as the functionality is not yet built.",
  "frontend/src/hooks/useBlockedAccountHelp.ts": "Manages blocked account help progress state with localStorage persistence per user principal, providing functions to navigate steps, complete steps, toggle checklist items, and reset progress.",
  "frontend/src/hooks/useCases.ts": "Provides React Query hooks for CRUD operations on cases stored in client-side storage, including fetching all cases, getting by ID, creating, updating, and attaching evidence/appeals to cases.",
  "frontend/src/hooks/useCollectiveReports.ts": "Defines hooks for submitting and retrieving collective reports, but both operations throw errors as the backend implementation is not available.",
  "frontend/src/hooks/useCurrentUser.ts": "Wraps Internet Identity hook to provide simplified user authentication state including principal ID, short ID, authentication status, and logout function.",
  "frontend/src/hooks/useEvidence.ts": "Provides React Query hooks for evidence operations (get all, upload, delete) but all backend calls are unimplemented as evidence is stored in IndexedDB on the client side.",
  "frontend/src/hooks/useGatewayPayment.ts": "Manages payment gateway flow state with mutations for creating payment sessions and checking payment status, tracking flow state (idle, initiating, pending, completed, failed) and invalidating subscription queries on success.",
  "frontend/src/hooks/useHomepageStyleVariant.ts": "Manages homepage style variant selection (A, B, or C) with localStorage persistence and provides a toggle function to cycle through variants.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, delegation validation, and AuthClient configuration with idle handling options.",
  "frontend/src/hooks/useIsAdmin.ts": "React Query hook that checks if the current caller is an admin by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useLossProfile.ts": "Provides hooks to get and set user loss profiles via backend actor, though the get operation returns null as the backend method is not yet implemented.",
  "frontend/src/hooks/useMediaRecorder.ts": "Custom hook for recording audio or video using MediaRecorder API, managing recording state (recording, paused, duration, errors) and providing start, stop, pause, resume, and cancel functions.",
  "frontend/src/hooks/useMercadoPagoPayment.ts": "File appears to be empty or truncated in the provided content.",
  "frontend/src/hooks/usePagBankPayment.ts": "Custom React hook managing PagBank payment flow state (idle, initiating, pending, completed, failed) with mutations for creating payment sessions, checking payment status, and invalidating subscription queries on success.",
  "frontend/src/hooks/usePublicPaymentConfig.ts": "React Query hook that fetches public (non-sensitive) payment provider configuration from the backend actor with 30-second cache and retry logic.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for fetching a \"Reviso motivada\" message; currently returns a not-available message as the backend method is not implemented.",
  "frontend/src/hooks/useSubscription.ts": "Hooks for fetching subscription status and evaluating user entitlements using the backend actor and subscription rules engine.",
  "frontend/src/hooks/useTestimonials.ts": "React Query hooks for fetching approved/pending testimonials, submitting new testimonials, and updating testimonial status (admin only) with error sanitization and cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the current user's profile using the backend actor with query invalidation on successful save.",
  "frontend/src/hooks/useWorkSessions.ts": "React Query hooks for work session management (log, end, add weather samples, fetch sessions); most mutations throw not-implemented errors as backend methods are incomplete.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a modern indigo-blue color palette for light/dark modes plus two alternative style variants (teal/cyan and warm sunset/orange).",
  "frontend/src/lib/casesStorage.ts": "LocalStorage-based CRUD operations for managing user cases including creation, updates, evidence/appeal attachments, timeline events, and status changes keyed by user principal.",
  "frontend/src/lib/collectiveOptions.ts": "Static configuration defining Brazilian regions (Fortaleza, Caucaia, Maracanaú) and their associated neighborhoods for collective/location selection.",
  "frontend/src/lib/evidenceIndexedDb.ts": "Manages IndexedDB storage for evidence media (images, audio, video) and metadata, providing hooks and functions to store/retrieve evidence with support for legacy image-only code.",
  "frontend/src/lib/lossCalculations.ts": "Calculates weekly, monthly, accumulated, and projected financial losses for delivery workers based on their loss profile and deactivation date.",
  "frontend/src/lib/mailto.ts": "Generates mailto links for platform-specific appeal emails and support contacts with pre-filled subjects and bodies.",
  "frontend/src/lib/payments/checkoutState.ts": "Manages session storage for the selected subscription plan during checkout flow.",
  "frontend/src/lib/payments/gatewayErrorMessages.ts": "Sanitizes generic payment gateway errors into user-friendly Portuguese messages, categorizing them by user error vs. admin action required.",
  "frontend/src/lib/payments/pagbankErrorMessages.ts": "Sanitizes PagBank-specific payment errors into user-friendly Portuguese messages with categorization for error handling.",
  "frontend/src/lib/payments/paymentErrorMessages.ts": "Centralized payment error sanitizer that maps backend errors to safe English user-facing messages with error type classification.",
  "frontend/src/lib/payments/pixPayload.ts": "Empty file, likely placeholder for PIX payment payload generation logic.",
  "frontend/src/lib/payments/providerConfig.ts": "Manages payment provider selection (gateway/pagbank) in localStorage and determines active provider from public config with PagBank prioritized over gateway.",
  "frontend/src/lib/pdfReport.ts": "Generates plain text loss reports as downloadable blobs with calculated weekly, monthly, and accumulated losses.",
  "frontend/src/lib/subscriptions/plans.ts": "Defines subscription plan metadata (free 24h, pro monthly, pro annual) with pricing, features, and lookup utilities.",
  "frontend/src/lib/subscriptions/rules.ts": "Evaluates subscription entitlement status from backend data, calculating expiry, trial/pro status, and formatting dates for display.",
  "frontend/src/lib/supportSummary.ts": "Generates formatted case summaries and mailto links for support emails, including case details, platform, block date, reason, evidence count, and appeal status.",
  "frontend/src/lib/templatesLibrary.ts": "Defines template data structures and provides a library of pre-written appeal templates, driver rights information, and evidence collection guides organized by category and platform.",
  "frontend/src/lib/testimonials/testimonialErrorMessages.ts": "Sanitizes raw testimonial mutation errors into user-friendly English messages, handling authentication, authorization, not-found, and generic error cases.",
  "frontend/src/lib/weatherClient.ts": "Fetches weather data from OpenWeatherMap API for Brazilian cities and maps weather conditions to backend enum types, with fallback to default values on error.",
  "frontend/src/lib/zipExport.ts": "Placeholder function for exporting evidence files as a ZIP archive; currently only logs evidence IDs to console.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for user management (block/unblock), payment configuration (Gateway/PagBank), and testimonial moderation, protected by AdminGate component.",
  "frontend/src/pages/AppealGeneratorPage.tsx": "Page for generating appeal letters using a wizard interface and evidence picker, with options to download or email the generated appeal text.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles payment flow for selected subscription plans, supporting both Gateway and PagBank providers with status tracking and error handling.",
  "frontend/src/pages/CollectiveInsightsPage.tsx": "Displays aggregated anonymous community data about platform blocks with filters for platform, region, and reason, showing distribution charts and trends.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying module cards (Evidence Tracker, Loss Calculator, Resource Generator, Collective Data) and quick access buttons (Payments, Profile, Quick Consultation) with navigation links.",
  "frontend/src/pages/DataPolicyPage.tsx": "Data policy page explaining LGPD compliance, legal bases for data processing, categories of collected data (personal, work, financial, evidence), and data treatment purposes with a scrollable card layout.",
  "frontend/src/pages/EvidenceDetailPage.tsx": "Detail view page for a single evidence item, displaying metadata (type, platform, region), upload time, and rendering media content (image, audio, or video) from IndexedDB based on evidence type.",
  "frontend/src/pages/EvidenceTrackerPage.tsx": "Evidence tracker page with tabbed interface for managing evidence uploads and work sessions, wrapped in AuthGate to require authentication.",
  "frontend/src/pages/LossCalculatorPage.tsx": "Loss calculator page displaying a form to input loss profile data and showing calculated results, projection charts, and report actions when profile data exists, wrapped in AuthGate.",
  "frontend/src/pages/PaymentsPage.tsx": "Payments information page showcasing available payment methods (PIX, credit card, bank slip) with trust badges and a call-to-action button to view subscription plans.",
  "frontend/src/pages/PlansBillingPage.tsx": "Plans and billing page displaying subscription tiers with features, pricing, and current subscription status, allowing users to upgrade or subscribe to different plans with highlighted recommendations.",
  "frontend/src/pages/PlansDashboardPage.tsx": "Displays subscription dashboard showing current plan status, expiry date, and comparison of available plans with upgrade options. Handles plan selection and navigation to checkout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a static privacy policy page with sections covering data collection, usage, storage, security, and user rights in Portuguese.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to update their name and email, and displays their Internet Computer Principal ID.",
  "frontend/src/pages/PublicOverviewPage.tsx": "Public landing page showcasing app features (evidence tracker, loss calculator, resource generator, collective data) with marketing banners, testimonials, and style variant toggle (A/B/C).",
  "frontend/src/pages/QuickProcessLookupPage.tsx": "Placeholder page for future process lookup functionality with a search form and alert indicating the feature is under development.",
  "frontend/src/pages/WorkSessionDetailPage.tsx": "Displays detailed information about a specific work session including start/end times, location, duration, and weather conditions with navigation back to sessions list.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript types and enums (Region, EvidenceType, ReasonCategory, Evidence, Appeal, CollectiveReport, PublicLossProfile) that mirror backend types but are not exported from the backend interface.",
  "frontend/src/types/case.ts": "Defines TypeScript interfaces for case management including Case, CaseEvidence, CaseAppeal, TimelineEvent, CaseStatus, and CreateCaseParams for tracking user appeals and evidence.",
  "frontend/src/types/mercadopago.ts": "Empty TypeScript file, likely a placeholder for future MercadoPago payment integration types.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file, likely a placeholder for QR code type definitions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme properties, container settings, typography, animations, and design tokens for the application UI.",
  "project_state.json": "Project metadata tracking architectural decisions, existing features (PagBank payment integration, checkout flows, admin panels), and pending feature requests for user registration, document verification, and administrative functions."
}