{
  "kind": "build_request",
  "title": "Add a responsive marketing banner highlighting app services and benefits for gig drivers (Uber/99/iFood/InDriver)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Create a reusable, responsive marketing banner component that highlights the app’s key services and advantages for gig workers, explicitly mentioning platforms like Uber, 99, iFood, and InDriver (and optionally “and others”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CRIE UM BANNER RESPONSIVO MOSTRANDO OS SERVIÇO E VANTAGENS DO APP PARA USUARIOS UBER ,99,IFOOD,INDRIVER ETC"
        ]
      },
      "acceptanceCriteria": [
        "A new React component exists for the marketing banner (reusable; not hardcoded only inside a single page).",
        "The banner layout is responsive: stacks cleanly on small screens and uses a multi-column layout on larger screens.",
        "The banner content visually includes the target platforms (Uber, 99, iFood, InDriver) via text and/or badges/chips/icons.",
        "The banner highlights at least 3 distinct benefits/services already provided by the app (e.g., evidence tracking, loss calculation, appeal generation, collective insights, privacy/security), without introducing new product features.",
        "No changes are required to backend canisters for this banner."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Integrate the responsive marketing banner into the public landing experience by placing it prominently on the unauthenticated entry page (frontend/src/pages/PublicOverviewPage.tsx), keeping the page’s existing CTAs and overall structure intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CRIE UM BANNER RESPONSIVO MOSTRANDO OS SERVIÇO E VANTAGENS DO APP PARA USUARIOS UBER ,99,IFOOD,INDRIVER ETC"
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated, the home route renders PublicOverviewPage and the new banner is visible without scrolling excessively (near the top section).",
        "Existing navigation actions (e.g., view plans, learn more) still work as before.",
        "The page remains visually consistent with the current dark-first theme and Tailwind token usage."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add the required banner image assets as static files under frontend/public/assets/generated and reference them from the banner component (no backend image serving).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CRIE UM BANNER RESPONSIVO MOSTRANDO OS SERVIÇO E VANTAGENS DO APP PARA USUARIOS UBER ,99,IFOOD,INDRIVER ETC"
        ]
      },
      "acceptanceCriteria": [
        "Banner image assets are present under frontend/public/assets/generated and are used by the banner component.",
        "The banner remains readable and accessible with sufficient contrast on both light/dark backgrounds used by the app theme.",
        "Images load correctly in the deployed build (no broken links; correct public paths)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep backend as a single Motoko actor; no backend changes are required for this UI-only request.",
    "Use English only in this build request document; in the app UI, keep copy consistent with the app’s existing language strategy."
  ],
  "nonGoals": [
    "Do not implement new backend endpoints or data models for marketing content.",
    "Do not add third-party marketing/analytics integrations.",
    "Do not redesign global navigation or subscription gating as part of this banner work."
  ],
  "imageRequirements": {
    "required": [
      "Wide responsive hero/banner illustration with delivery rider silhouette and abstract city/road shapes, dark-friendly palette (banner-hero.dim_1600x600.png)",
      "Square/vertical banner illustration variant optimized for mobile, same visual style (banner-hero-mobile.dim_900x900.png)"
    ],
    "edits": []
  }
}