{
  "kind": "build_request",
  "title": "Fix PIX QR code not displaying in checkout",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Debug and fix the PIX QR code display issue in the checkout flow. The QR code should be visible when users select PIX as the payment method.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "o qr code pix nao ta aparecendo"
        ]
      },
      "acceptanceCriteria": [
        "PIX QR code image renders correctly on the checkout page",
        "QR code is scannable and contains valid payment payload",
        "Copy-to-clipboard functionality works for PIX key and payload",
        "QR code displays properly on both desktop and mobile viewports"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify the PixQrCodeDisplay component is properly integrated in CheckoutPage and receives correct payment data from the PagBank payment flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "PixQrCodeDisplay component receives valid PIX payload data",
        "Payment status updates correctly after QR code is displayed",
        "Error states are handled gracefully if payment data is missing"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the PIX payload generation in pixPayload.ts creates valid BR Code format with correct CRC16 checksum for QR code scanning.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "Generated PIX payload follows EMV QR Code specification",
        "CRC16 checksum is calculated correctly",
        "Payload can be successfully scanned by banking apps"
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend payment configuration logic",
    "Maintain compatibility with existing PagBank integration",
    "Preserve the current checkout flow and payment status tracking"
  ],
  "nonGoals": [
    "Adding new payment methods",
    "Changing the overall checkout page design",
    "Modifying payment provider selection logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}