{
  "kind": "build_request",
  "title": "Adjust Style B homepage color tone to better match the new visual theme",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Refine the Style B (\"home-style-b\") color tone so the unauthenticated homepage (PublicOverviewPage + MarketingBanner) has a more cohesive, balanced palette across light and dark modes. Update the CSS variable overrides for Style B in `frontend/src/index.css` (e.g., background/card/accent/border/ring) and, if needed, adjust Style B-only gradient/opacity choices in `frontend/src/components/marketing/MarketingBanner.tsx` so the banner and page surfaces look consistent and readable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Want to try adjusting the color tone to match the new style?",
          "SIM"
        ]
      },
      "acceptanceCriteria": [
        "When the user toggles to Style B on the public homepage, the overall color tone looks consistent across the page sections and the MarketingBanner (no obvious mismatched tints between background, card surfaces, and banner gradient).",
        "In both light and dark mode with Style B enabled, text remains comfortably readable (no low-contrast combinations on background/card/accent surfaces).",
        "Changes are limited to Style B behavior; Style A styling remains visually unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only UI component sources).",
    "Do not modify any immutable hook files listed in `SYSTEM_CONTEXT.frontend.immutablePaths`.",
    "Keep all backend logic unchanged (this is a styling-only adjustment)."
  ],
  "nonGoals": [
    "Adding new homepage features or new routes.",
    "Changing the Style A theme or global typography system beyond what is required to tune Style B colors.",
    "Translating or rewriting existing Portuguese UI copy."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}