{
  "kind": "build_request",
  "title": "Update app color scheme to match logo tonality",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the application's color palette in frontend/index.css to use the same tonality as the logo colors. Replace the current warm orange primary and deep navy blue secondary colors with colors that match the logo's visual identity while maintaining appropriate contrast ratios for accessibility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "The primary and secondary color variables in the CSS use tonalities matching the logo",
        "All color references throughout the app reflect the new palette",
        "Text remains readable with appropriate contrast against backgrounds",
        "Dark mode color variants are updated to maintain consistency"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the theme color in frontend/index.html and frontend/public/manifest.webmanifest to match the updated primary color from the new palette, ensuring consistency across browser UI elements and PWA theming.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "The theme-color meta tag in index.html reflects the new primary color",
        "The theme_color in manifest.webmanifest matches the updated palette",
        "Browser UI chrome displays the correct brand color"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Maintain WCAG AA contrast ratio standards for text and interactive elements",
    "Preserve the OKLCH color space system already in use"
  ],
  "nonGoals": [
    "Creating or modifying the logo file itself",
    "Changing the overall layout or component structure",
    "Modifying backend color-related configurations"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}