{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PagBank Payment Gateway Integration",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Add PagBank payment provider configuration UI in admin dashboard alongside existing gateway provider settings",
      "acceptanceCriteria": [
        "Admin can select PagBank as a payment provider in the payment configuration panel",
        "PagBank configuration includes fields for API credentials (token, email) and sandbox/production mode toggle",
        "Configuration is persisted in backend state and retrievable via public payment config query"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add PagBank configuration section with form fields for merchantId, clientId, clientSecret, webhookSecret, and enabled toggle. Include sandbox/production mode indicator. Wire the PagBank fields into the existing payment configuration mutation alongside the gateway provider section. Display current PagBank config state from usePublicPaymentConfig hook. Verify the authorization component's usage instructions before implementing admin-only access."
        },
        {
          "path": "frontend/src/hooks/useAdminPaymentConfig.ts",
          "operation": "modify",
          "description": "Update the PaymentConfig type to match the backend interface structure with both gatewayProvider and pagbankProvider fields. Ensure the mutation properly serializes PagBank configuration fields when calling setPaymentConfig backend method."
        },
        {
          "path": "frontend/src/hooks/usePublicPaymentConfig.ts",
          "operation": "modify",
          "description": "Update return type to match backend's PublicPaymentConfig structure including pagbankProvider field with enabled flag. Ensure the query properly handles both gateway and PagBank provider configurations."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create PagBank payment flow hook that initiates payment sessions and handles checkout redirects",
      "acceptanceCriteria": [
        "Hook provides mutation to create PagBank payment with selected plan",
        "On successful session creation, user is redirected to PagBank checkout URL",
        "After returning from PagBank, hook polls payment status and updates UI accordingly",
        "Hook invalidates subscription queries on successful payment completion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePagBankPayment.ts",
          "operation": "create",
          "description": "Create a custom hook that mirrors the structure of useGatewayPayment.ts. Provide mutations for creating PagBank payment sessions via createPagBankPaymentSession backend method and checking payment status via checkPaymentStatus. Include state management for paymentId, checkoutUrl, and polling status. Implement redirect logic to navigate to PagBank checkout URL on successful session creation. Add polling mechanism that checks payment status every 5 seconds after user returns from checkout. Invalidate subscription queries on payment completion. Return interface matching useGatewayPayment for consistency."
        },
        {
          "path": "frontend/src/lib/payments/pagbankErrorMessages.ts",
          "operation": "create",
          "description": "Create error sanitization utility following the pattern of gatewayErrorMessages.ts. Map backend PagBank error responses to user-friendly Portuguese messages. Categorize errors by type (configuration, authentication, network, validation) and indicate whether admin action is required. Export sanitizePagBankError function."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update CheckoutPage to conditionally render PagBank payment flow based on active provider configuration",
      "acceptanceCriteria": [
        "CheckoutPage reads active payment provider from public payment config",
        "When PagBank is active, page uses usePagBankPayment hook instead of useGatewayPayment",
        "Payment status panel displays PagBank-specific status messages and actions",
        "Existing gateway payment flow continues to work when gateway provider is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add logic to read public payment config via usePublicPaymentConfig hook. Conditionally import and use either useGatewayPayment or usePagBankPayment based on which provider is enabled in the config. If both are enabled, prioritize PagBank. Pass the appropriate payment hook state to PaymentStatusPanel. Ensure backward compatibility with existing gateway flow."
        },
        {
          "path": "frontend/src/components/payments/PaymentStatusPanel.tsx",
          "operation": "modify",
          "description": "Add provider parameter to distinguish between gateway and PagBank payment flows. Update status messages to be provider-aware (e.g., 'Redirecting to PagBank...' vs 'Redirecting to gateway...'). Handle PagBank-specific status codes and error messages using the pagbankErrorMessages utility. Maintain existing gateway flow UI."
        },
        {
          "path": "frontend/src/lib/payments/providerConfig.ts",
          "operation": "modify",
          "description": "Extend provider selection storage to support 'pagbank' as a valid provider option alongside 'gateway'. Update type definitions and validation logic. Add helper functions to determine active provider from PublicPaymentConfig."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Create PagBank setup guide component with step-by-step integration instructions for administrators",
      "acceptanceCriteria": [
        "Component displays numbered steps with clear instructions for PagBank account creation",
        "Includes guidance on obtaining API token and email credentials from PagBank dashboard",
        "Provides webhook URL format and instructions for configuring it in PagBank settings",
        "Includes testing checklist for sandbox mode validation before production use"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PagBankSetupGuide.tsx",
          "operation": "create",
          "description": "Create an instructional component following the pattern intended for MercadoPagoSetupGuide.tsx. Structure content with numbered steps covering: (1) Creating a PagBank business account, (2) Accessing the PagBank developer dashboard, (3) Generating API credentials (merchant ID, client ID, client secret), (4) Configuring webhook URL (provide format: https://<canister-id>.icp0.io/pagbank-webhook), (5) Testing in sandbox mode, (6) Switching to production. Include code snippets, links to PagBank documentation, and a pre-production testing checklist. Use Card and Alert components from shadcn/ui for layout."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a collapsible section or dialog trigger that renders the PagBankSetupGuide component within the payment configuration area. Position it near the PagBank configuration form to provide contextual help to administrators."
        }
      ]
    }
  ]
}