{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin dashboard (frontend) for tracking subscriptions and blocking/unblocking users",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Create an admin-only Admin Dashboard page to list user access info, search/filter users, and block/unblock with confirmation.",
      "acceptanceCriteria": [
        "The admin dashboard route renders only for admin users; non-admins see an access denied screen or are redirected away.",
        "The page loads user summaries from the backend and renders them in a readable, mobile-friendly table/list.",
        "An admin can block/unblock a user from the UI; after the action, the list refreshes and shows the updated blocked state.",
        "The page includes a search/filter control that narrows the visible list without breaking the full list fetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "create",
          "description": "Add React Query hooks for admin capabilities: fetching user access summaries (getAllUserAccessInfo), and mutations for blockUser/unblockUser. Ensure mutations invalidate/refetch the user list query. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useIsAdmin.ts",
          "operation": "create",
          "description": "Add a small hook that queries the backend capability isCallerAdmin (via useActor + React Query) and exposes { isAdmin, isLoading, error } for gating admin-only UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminGate.tsx",
          "operation": "create",
          "description": "Create an admin-only gate component that composes the existing AuthGate and the new useIsAdmin hook; show a clear access-denied UI for authenticated non-admins and a loading state while role is being resolved. Use existing shadcn/ui components (e.g., Card/Alert/Button) without editing immutable ui paths. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "create",
          "description": "Implement the Admin Dashboard UI: load user list via useAdmin hook, render a mobile-friendly list/table (e.g., cards on small screens + table on larger screens), show principal + optional profile (name/email) + subscription plan + start/end times + entitlement-like status + blocked state; provide search/filter by principal/name/email; add block/unblock actions with confirmation (use existing shadcn/ui AlertDialog/Dialog components) and refresh list after changes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Wire the Admin Dashboard into TanStack Router and show the Admin navigation entry only for admins.",
      "acceptanceCriteria": [
        "An “Admin” (or equivalent) navigation item appears only for admin users and routes to the Admin Dashboard page.",
        "No navigation entry is shown to non-admin users.",
        "Routing is added via the existing TanStack Router setup (frontend/src/App.tsx) without modifying immutable frontend paths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for the Admin Dashboard page and ensure it is wired into the existing routeTree. Wrap the route component with the new AdminGate to enforce admin-only access at the route level. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Integrate an “Admin” navigation item (desktop + mobile menu) that is visible only when the authenticated user is an admin (use the new useIsAdmin hook). Ensure non-admin users never see the entry, and the item routes to the Admin Dashboard route. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}