{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Responsive gig-driver marketing banner on public landing page",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Create a reusable responsive MarketingBanner component highlighting existing app services/benefits for gig drivers, explicitly mentioning Uber, 99, iFood, and InDriver.",
      "acceptanceCriteria": [
        "A new React component exists for the marketing banner (reusable; not hardcoded only inside a single page).",
        "The banner layout is responsive: stacks cleanly on small screens and uses a multi-column layout on larger screens.",
        "The banner content visually includes the target platforms (Uber, 99, iFood, InDriver) via text and/or badges/chips/icons.",
        "The banner highlights at least 3 distinct benefits/services already provided by the app (e.g., evidence tracking, loss calculation, appeal generation, collective insights, privacy/security), without introducing new product features.",
        "No changes are required to backend canisters for this banner."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/MarketingBanner.tsx",
          "operation": "create",
          "description": "Add a reusable MarketingBanner React component using Tailwind for a responsive (stack-on-mobile, multi-column-on-desktop) layout; include platform callouts (Uber, 99, iFood, InDriver, and optional “e outros”) and at least 3 existing benefits (e.g., Evidências, Calculadora de Perdas, Recursos, Dados Coletivos, Segurança/Privacidade). Reference the static hero images at frontend/public/assets/generated/banner-hero.dim_1600x600.png and frontend/public/assets/generated/banner-hero-mobile.dim_900x900.png. Ensure dark-first theme consistency and accessible contrast. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Integrate the MarketingBanner into the unauthenticated PublicOverviewPage near the top while preserving existing CTAs and structure.",
      "acceptanceCriteria": [
        "When not authenticated, the home route renders PublicOverviewPage and the new banner is visible without scrolling excessively (near the top section).",
        "Existing navigation actions (e.g., view plans, learn more) still work as before.",
        "The page remains visually consistent with the current dark-first theme and Tailwind token usage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublicOverviewPage.tsx",
          "operation": "modify",
          "description": "Import and render the new MarketingBanner prominently near the top of the PublicOverviewPage content (before/around the current hero section) without removing or breaking existing headings, CTAs (Ver Planos / Saiba Mais), and existing sections/cards. Keep styling consistent with the current Tailwind token usage and dark-first theme. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add required banner image assets under frontend/public/assets/generated and ensure the banner component references them as static public assets.",
      "acceptanceCriteria": [
        "Banner image assets are present under frontend/public/assets/generated and are used by the banner component.",
        "The banner remains readable and accessible with sufficient contrast on both light/dark backgrounds used by the app theme.",
        "Images load correctly in the deployed build (no broken links; correct public paths)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/banner-hero.dim_1600x600.png",
          "operation": "create",
          "description": "Add the generated wide hero/banner illustration asset as a static file to be used by MarketingBanner (no backend image serving)."
        },
        {
          "path": "frontend/public/assets/generated/banner-hero-mobile.dim_900x900.png",
          "operation": "create",
          "description": "Add the generated square/vertical mobile hero illustration asset as a static file to be used by MarketingBanner (no backend image serving)."
        },
        {
          "path": "frontend/src/components/marketing/MarketingBanner.tsx",
          "operation": "modify",
          "description": "Verify the component references the exact static asset paths frontend/public/assets/generated/banner-hero.dim_1600x600.png and frontend/public/assets/generated/banner-hero-mobile.dim_900x900.png, uses responsive image presentation (desktop vs mobile), and maintains accessible contrast/readability across theme backgrounds. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}