{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix PIX QR code display bug in checkout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Debug and fix the PIX QR code generation and display logic in the checkout flow to ensure the QR code appears correctly when users select PIX payment method",
      "acceptanceCriteria": [
        "PIX QR code image renders visibly in the checkout page when PIX payment is selected",
        "QR code payload is generated correctly using the pixPayload utility",
        "QR code image URL is generated successfully via qrCodeGenerator",
        "Copy-to-clipboard functionality works for both QR payload and PIX key",
        "No console errors related to QR code generation or display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PixQrCodeDisplay.tsx",
          "operation": "modify",
          "description": "Review and fix the PIX QR code generation and display logic. Ensure the component correctly receives PIX email key prop, generates QR code payload using frontend/src/lib/payments/pixPayload.ts, creates QR code image URL using frontend/src/lib/payments/qrCodeGenerator.ts, and properly handles loading/error states. Verify that the QR code image element has proper src attribute and error handling. Add console logging for debugging QR code generation steps if errors occur."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Review the CheckoutPage integration to ensure PixQrCodeDisplay component is properly rendered when PIX payment method is selected. Verify that the PIX email key (from PagBank config or payment provider config) is correctly passed as a prop to PixQrCodeDisplay. Ensure conditional rendering logic properly shows the QR code component based on payment provider selection and payment flow state. Add proper loading states while fetching payment configuration."
        },
        {
          "path": "frontend/src/lib/payments/pixPayload.ts",
          "operation": "modify",
          "description": "Review the PIX payload generation function to verify it correctly formats the BR Code EMV specification payload including merchant account information (PIX key/email), transaction amount, merchant name, merchant city, and CRC16 checksum. Add validation for required fields and return informative error messages if payload generation fails. Ensure proper string encoding and TLV field formatting."
        },
        {
          "path": "frontend/src/lib/payments/qrCodeGenerator.ts",
          "operation": "modify",
          "description": "Review the QR code image generation using qrserver.com API. Ensure the function correctly encodes the PIX payload, constructs valid API URLs, handles network errors gracefully, and returns usable image URLs or data URLs. Add error handling for API failures and validate that generated URLs are accessible. Consider adding retry logic for network failures."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Verify that the PixQrCodeDisplay component properly receives the PIX email key and displays it alongside the QR code",
      "acceptanceCriteria": [
        "PIX email key is passed correctly to PixQrCodeDisplay component",
        "Email key displays below the QR code with copy button",
        "Component handles loading and error states appropriately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PixQrCodeDisplay.tsx",
          "operation": "modify",
          "description": "Verify the component's props interface includes pixKey or email parameter. Ensure the PIX email key is displayed in the UI with proper styling below or alongside the QR code. Verify the copy-to-clipboard functionality works for the PIX email key. Add proper TypeScript typing for props and validate that the email key prop is required and non-empty before rendering."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Review how the PIX email key is retrieved from payment configuration (either from PagBankTransparentCheckoutConfig.email or other provider config). Ensure this email key is passed as a prop to PixQrCodeDisplay component. Add conditional checks to ensure email key exists before rendering the QR code component, showing appropriate error message if missing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Check CheckoutPage integration with payment providers to ensure PIX QR code display is triggered correctly for both Gateway and PagBank payment flows",
      "acceptanceCriteria": [
        "PIX QR code displays when using Gateway provider",
        "PIX QR code displays when using PagBank provider",
        "Proper conditional rendering based on selected payment provider",
        "Payment amount is correctly passed to QR code generation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Review the payment provider selection logic and conditional rendering of PixQrCodeDisplay for both Gateway and PagBank providers. Ensure the component is shown in the appropriate payment flow states. Verify that the payment amount from the selected subscription plan is correctly retrieved and passed to the PIX payload generation. Add proper state management to track which payment provider is active and show QR code accordingly. Ensure proper integration with useGatewayPayment and usePagBankPayment hooks."
        },
        {
          "path": "frontend/src/hooks/useGatewayPayment.ts",
          "operation": "modify",
          "description": "Review the payment flow state management to ensure it properly exposes payment session data needed for PIX QR code generation. Verify that the payment amount and PIX key are available in the hook's return value when needed by CheckoutPage. Ensure proper error handling if payment session creation fails."
        },
        {
          "path": "frontend/src/hooks/usePagBankPayment.ts",
          "operation": "modify",
          "description": "Review the PagBank payment flow state management to ensure it properly exposes payment session data and PIX configuration needed for QR code generation. Verify that the payment amount and PIX key from transparent checkout config are accessible. Ensure proper integration with usePagBankTransparentCheckout hook for retrieving PIX email configuration."
        }
      ]
    }
  ]
}