{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix PIX QR code not displaying in checkout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Debug and fix the PIX QR code display issue in the checkout flow so QR codes render correctly when users select PIX as payment method",
      "acceptanceCriteria": [
        "PIX QR code image renders correctly on the checkout page",
        "QR code is scannable and contains valid payment payload",
        "Copy-to-clipboard functionality works for PIX key and payload",
        "QR code displays properly on both desktop and mobile viewports"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PixQrCodeDisplay.tsx",
          "operation": "modify",
          "description": "Debug and fix QR code rendering logic. Verify that the component correctly receives PIX payload data from props, generates QR code image using qrCodeGenerator utility, displays the image with proper dimensions and responsive styling, and implements copy-to-clipboard for both PIX key and payload string. Ensure error states are handled when QR generation fails."
        },
        {
          "path": "frontend/src/lib/payments/qrCodeGenerator.ts",
          "operation": "modify",
          "description": "Verify QR code generation function creates valid data URLs from PIX payloads. Check URL encoding, size parameters passed to qrserver.com API, and error handling for failed requests. Ensure generated QR codes are properly formatted and base64-encoded."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Debug payment flow integration with PixQrCodeDisplay component. Verify that after PagBank payment session creation, the PIX payload is correctly extracted from the response and passed to PixQrCodeDisplay. Check conditional rendering logic that shows/hides the QR code based on payment status and provider selection. Ensure proper state management during the payment lifecycle."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Verify PixQrCodeDisplay component integration in CheckoutPage receives correct payment data from PagBank payment flow",
      "acceptanceCriteria": [
        "PixQrCodeDisplay component receives valid PIX payload data",
        "Payment status updates correctly after QR code is displayed",
        "Error states are handled gracefully if payment data is missing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Verify component wiring between payment session creation and PixQrCodeDisplay. Check that payment response data structure matches expected format and PIX payload is properly extracted. Add console logging or error boundaries to debug data flow. Ensure PaymentStatusPanel coordinates with PixQrCodeDisplay to show appropriate UI states (pending, completed, failed)."
        },
        {
          "path": "frontend/src/hooks/usePagBankPayment.ts",
          "operation": "modify",
          "description": "Review payment session creation mutation and verify the response data structure includes PIX payload in the expected format. Check error handling for failed session creation. Ensure payment status checking mutation properly updates React Query cache to trigger UI updates in CheckoutPage."
        },
        {
          "path": "frontend/src/components/payments/PaymentStatusPanel.tsx",
          "operation": "modify",
          "description": "Verify payment status panel coordinates with PIX QR code display. Ensure proper conditional rendering based on payment state (pending shows QR code, completed hides it, failed shows retry). Check that status updates from backend properly trigger re-renders."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure PIX payload generation creates valid BR Code format with correct CRC16 checksum for QR code scanning",
      "acceptanceCriteria": [
        "Generated PIX payload follows EMV QR Code specification",
        "CRC16 checksum is calculated correctly",
        "Payload can be successfully scanned by banking apps"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/payments/pixPayload.ts",
          "operation": "modify",
          "description": "Debug and verify PIX payload generation follows EMV QR Code specification for BR Code format. Review CRC16 checksum calculation implementation for correctness. Validate TLV (Tag-Length-Value) formatting of all required fields including merchant account information, transaction amount, merchant category code, and country code. Test generated payloads with banking app scanners to ensure compliance. Add comprehensive error handling for invalid input parameters."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Verify that payment amount, merchant details, and transaction ID are correctly passed to PIX payload generator. Check that the generated payload string is properly formatted before being sent to QR code generator. Add validation to ensure all required PIX parameters are present before attempting payload generation."
        }
      ]
    }
  ]
}