{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend Payment Gateway Integration",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update checkout page to integrate with new payment gateway and handle payment flow initiation",
      "acceptanceCriteria": [
        "Checkout page displays available payment methods from the gateway",
        "User can initiate a payment by clicking a payment button",
        "Payment initiation calls the new backend payment session creation method",
        "Loading states are shown during payment initiation",
        "Error messages are displayed if payment initiation fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Integrate the new payment gateway flow using the useGatewayPayment hook. Replace or extend the existing payment provider configuration display with interactive payment method buttons. Add the selected subscription plan display using checkoutState utilities. Include loading states during payment initiation and error message displays for failed payment attempts. Wire the payment button to call the createPaymentSession backend method through the custom hook. Display the trust badges component to reassure users during checkout."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create custom React hook to manage payment flow state and interactions with backend payment capabilities",
      "acceptanceCriteria": [
        "Hook provides methods to start a payment session",
        "Hook provides methods to check payment status",
        "Hook manages payment flow state (idle, initiating, pending, completed, failed)",
        "Hook uses React Query for data fetching and caching",
        "Hook invalidates subscription queries on successful payment"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGatewayPayment.ts",
          "operation": "create",
          "description": "Create a custom hook that manages the payment gateway flow state. Use React Query mutations for createPaymentSession (calls actor.createPaymentSession) and checkPaymentStatus (calls actor.checkPaymentStatus). Maintain local state for payment flow phases: idle, initiating, pending, completed, failed. Provide methods: startPayment(plan), checkStatus(paymentId), and reset(). On successful payment completion, invalidate the subscription status query using queryClient.invalidateQueries(['subscriptionStatus']). Handle errors from backend payment methods and expose them for UI display. Use the actor from useActor hook to access backend payment capabilities."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add payment status tracking component with UI feedback for all payment states",
      "acceptanceCriteria": [
        "Component shows pending state while payment is being processed",
        "Component displays success message with confirmation details when payment completes",
        "Component shows error message with retry option if payment fails",
        "Component provides navigation back to plans page or forward to dashboard after completion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PaymentStatusPanel.tsx",
          "operation": "modify",
          "description": "Implement the payment status tracking component that consumes payment state from useGatewayPayment hook. Display different UI states: pending (spinner with processing message), completed (success checkmark with confirmation details and navigation to dashboard), failed (error icon with retry button and navigation back to plans). Use shadcn/ui Alert, Button, and Card components. Include Portuguese user-facing messages. Add navigation using TanStack Router's useNavigate hook. Provide a retry mechanism that calls the payment initiation method again."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update admin dashboard payment configuration section for gateway-specific settings",
      "acceptanceCriteria": [
        "Admin can view current gateway configuration status",
        "Admin can update gateway API credentials through a secure form",
        "Admin can enable/disable the gateway provider",
        "Form validation prevents saving incomplete credentials",
        "Success/error messages are shown after configuration updates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Extend the existing payment gateway configuration tab. Add form fields for gateway-specific settings including enabled toggle and secure credential inputs (use password input type for API keys). Fetch current configuration using usePublicPaymentConfig hook. Use the useAdminPaymentConfig mutation hook to save updated configuration. Add form validation to ensure credentials are complete before allowing save. Display success toast on successful update and error alerts on failure. Use shadcn/ui Form, Input, Switch, and Label components. Include Portuguese labels and help text."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add gateway payment error handling utilities that map error codes to Portuguese user messages",
      "acceptanceCriteria": [
        "Error mapping function handles common gateway error scenarios",
        "Messages are in Portuguese and user-friendly",
        "Error messages distinguish between user errors and system errors",
        "Function follows the same pattern as existing paymentErrorMessages.ts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/payments/gatewayErrorMessages.ts",
          "operation": "create",
          "description": "Create error sanitization utilities following the same pattern as frontend/src/lib/payments/paymentErrorMessages.ts. Export a sanitizeGatewayError function that accepts raw backend error strings and returns user-friendly Portuguese messages. Map common gateway error scenarios: invalid credentials, insufficient funds, payment declined, timeout, network errors, validation failures. Distinguish between user-actionable errors (e.g., 'Cartão recusado - tente outro método') and system errors (e.g., 'Erro no gateway - contate o suporte'). Include a fallback for unknown errors. Return an object with { message: string, isUserError: boolean, requiresAdminAction: boolean }."
        }
      ]
    }
  ]
}